[
  {
    "key": 0,
    "name": "White Chocolate Raspberry Truffle Ice Cream",
    "description": "A truly exquisite ice cream inspired by fine chocolate truffles. We begin with pure white chocolate ice cream and swirl in satisfying chunks of chocolaty fudge truffles and a tangy raspberry ribbon.",
    "rating": 4.9,
    "rating_count": 168,
    "ingredients": "CREAM, SKIM MILK, SUGAR, RASPBERRY PUREE, LACTOSE REDUCED SKIM MILK, CORN SYRUP, EGG YOLKS, COCONUT OIL, SOYBEAN OIL, COCOA PROCESSED WITH ALKALI, COCOA POWDER, NATURAL FLAVOR, LEMON JUICE CONCENTRATE, PECTIN, COCOA BUTTER, SALT, VANILLA EXTRACT",
    "picture": "/hd/0_hd.png"
  },
  {
    "key": 1,
    "name": "Banana Peanut Butter Chip Ice Cream",
    "description": "Ribbons of rich peanut butter and bits of chocolate chips are folded into sweet banana ice cream to create this playfully indulgent flavor.",
    "rating": 4.7,
    "rating_count": 80,
    "ingredients": "CREAM, SKIM MILK, SUGAR, PEANUTS, BANANA PUREE, EGG YOLKS, COCONUT OIL, PEANUT OIL, COCOA PROCESSED WITH ALKALI, BUTTER OIL, SOY LECITHIN, SALT, NATURAL FLAVOR, MILK",
    "picture": "/hd/1_hd.png"
  },
  {
    "key": 2,
    "name": "Bourbon Praline Pecan Ice Cream",
    "description": "Treat yourself to ice cream infused with smooth Bourbon sprinkled with brown sugar and given the perfect crunch with praline pecans.",
    "rating": 4.1,
    "rating_count": 191,
    "ingredients": "CREAM, SKIM MILK, SUGAR, BROWN SUGAR, EGG YOLKS, PECANS, CORN SYRUP, MOLASSES, SWEETENED CONDENSED SKIM MILK (SKIM MILK, SUGAR), MAPLE SYRUP, BUTTER (CREAM, SALT), NATURAL FLAVORS (CONTAINS BARLEY), PECTIN, SALT, CORN STARCH, BAKING SODA, CARAMEL FLAVOR, BOURBON",
    "picture": "/hd/2_hd.png"
  },
  {
    "key": 3,
    "name": "Bourbon Vanilla Bean Truffle Ice Cream",
    "description": "A classic pairing made even better, enjoy creamy vanilla bean ice cream dotted with chocolate truffles and swirled with spicy Bourbon.",
    "rating": 4,
    "rating_count": 89,
    "ingredients": "CREAM, SKIM MILK, SUGAR, HONEY, EGG YOLKS, BROWN SUGAR, MOLASSES, COCONUT OIL, SOYBEAN OIL, COCOA PROCESSED WITH ALKALI, BOURBON, COCOA, CORN STARCH, GROUND VANILLA BEANS, NATURAL FLAVORS, VANILLA EXTRACT, PECTIN, SOY LECITHIN",
    "picture": "/hd/3_hd.png"
  },
  {
    "key": 4,
    "name": "Butter Pecan Ice Cream",
    "description": "An American classic, revisited with our passion for singular flavor. We blend spoonful after spoonful of buttery roasted pecans with pure, sweet cream to create a delight like no other.",
    "rating": 4.3,
    "rating_count": 111,
    "ingredients": "CREAM, SKIM MILK, SUGAR, PECANS, LACTOSE REDUCED SKIM MILK, CORN SYRUP, EGG YOLKS, COCONUT OIL, SALT, BUTTER, CREAM, SALT, VANILLA EXTRACT",
    "picture": "/hd/4_hd.png"
  },
  {
    "key": 5,
    "name": "Caramel Soft Dipped Ice Cream Bar",
    "description": "Introducing New Soft Dipped Caramel Ice Cream Bars. A delicious pairing of indulgent caramel ice cream with a rich caramel swirl, covered in a soft chocolate truffle coating.",
    "rating": 4.9,
    "rating_count": 8,
    "ingredients": "CARAMEL ICE CREAM: CREAM, SKIM MILK, SUGAR, EGG YOLKS, SWEETENED CONDENSED MILK (CONDENSED MILK SUGAR), CORN SYRUP, SALT, PECTIN, BAKING SODA, VANILLA EXTRACT. CHOCOLATY COATING: SUGAR, COCOA PROCESSED WITH ALKALI, CANOLA OIL, PALM OIL, MILKFAT, SOY LECITHIN. SALTED CARAMEL SWIRL: CORN SYRUP, SWEETENED CONDENSED MILK (CONDENSED MILK SUGAR), CREAM, SUGAR, WATER, BUTTER (CREAM, SALT), SALT, PECTIN, MILKFAT, SOY LECITHIN.\nCONTAINS: MILK, EGG AND SOY INGREDIENTS",
    "picture": "/hd/5_hd.png"
  },
  {
    "key": 6,
    "name": "Caramel Cone Ice Cream",
    "description": "We balance a creamy blend of caramel ice cream and rich caramel swirls with the sweet crunch of chocolaty cone pieces to create a sweet, harmonious bite.",
    "rating": 4.7,
    "rating_count": 185,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, SWEETENED CONDENSED MILK, MILK, SUGAR, CORN SYRUP, BUTTER, CREAM, SALT, SALT, PECTIN, NATURAL FLAVOR, SUGAR, CONE PIECES, WHEAT FLOUR, SUGAR, SOYBEAN OIL, SOY LECITHIN, SALT, COCONUT OIL, COCOA, COCOA PROCESSED WITH ALKALI, BUTTER OIL, SUGAR, CONDENSED SKIM MILK, CORN SYRUP, WATER, BUTTER, CREAM, SALT, SALT, PECTIN, NATURAL FLAVOR, BAKING SODA",
    "picture": "/hd/6_hd.png"
  },
  {
    "key": 7,
    "name": "Caramel Cone Ice Cream Bar",
    "description": "Your favorite Caramel Pizzelle Bar, renamed. Golden ribbons of caramel in creamy vanilla gelato, enrobed in rich milk chocolate and crunchy italian style cone pieces.",
    "rating": 4.8,
    "rating_count": 23,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, MILK CHOCOLATE, SUGAR, WHOLE MILK POWDER, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT, CORN SYRUP, SWEETENED CONDENSED MILK, CONDENSED MILK, SUGAR, CREAM, SUGAR, WATER, BUTTER, CREAM, SALT, SALT, PECTIN, WHEAT FLOUR, SUGAR, SOYBEAN OIL, SOY LECITHIN",
    "picture": "/hd/7_hd.png"
  },
  {
    "key": 8,
    "name": "Cherry Vanilla Ice Cream",
    "description": "The cherries of spring lend their delightful taste to our cherry vanilla ice cream. It is the perfect combination of pure, sweet cream and juicy black cherries.",
    "rating": 4.2,
    "rating_count": 26,
    "ingredients": "CREAM, SKIM MILK, SUGAR, BLACK CHERRIES, EGG YOLKS, CHERRIES, CHERRY JUICE CONCENTRATE, VANILLA EXTRACT, APPLE JUICE, NATURAL FLAVOR, LEMON JUICE CONCENTRATE, PECTIN",
    "picture": "/hd/8_hd.png"
  },
  {
    "key": 9,
    "name": "Chocolate Ice Cream",
    "description": "Rich, creamy, and totally indulgent. Made from the finest cocoa and pure, sweet cream, our chocolate ice cream is the ultimate experience.",
    "rating": 4.9,
    "rating_count": 90,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, COCOA PROCESSED WITH ALKALI, EGG YOLKS",
    "picture": "/hd/9_hd.png"
  },
  {
    "key": 10,
    "name": "Chocolate Soft Dipped Ice Cream Bar",
    "description": "Introducing New Soft Dipped Chocolate Ice Cream Bars. A decadent pairing of rich chocolate ice cream covered in a soft chocolate truffle coating.",
    "rating": 2.6,
    "rating_count": 25,
    "ingredients": "CHOCOLATE ICE CREAM: CREAM, SKIM MILK, SUGAR, COCOA PROCESSED WITH ALKALI, EGG YOLKS. CHOCOLATY COATING: SUGAR, COCOA PROCESSED WITH ALKALI, CANOLA OIL, PALM OIL, SOY LECITHIN.\nCONTAINS: MILK, EGG AND SOY INGREDIENTS",
    "picture": "/hd/10_hd.png"
  },
  {
    "key": 11,
    "name": "Chocolate Chip Cookie Dough Ice Cream",
    "description": "For those who relish a taste of something playful, we re-created a childhood treat. We blend chunks of buttery cookie dough and sweet fudge chips with our finest pure vanilla ice cream. Ah, such sweet memories.",
    "rating": 3.3,
    "rating_count": 29,
    "ingredients": "CREAM, SKIM MILK, SUGAR, WHEAT FLOUR, BROWN SUGAR, MOLASSES, SUGAR, BUTTER, CREAM, SALT, EGG YOLKS, COCONUT OIL, VANILLA EXTRACT, COCOA PROCESSED WITH ALKALI, CORN OIL, FRUCTOSE, BUTTER OIL, CORN SYRUP, CORN STARCH, SOY LECITHIN, SALT, BAKING SODA, NATURAL FLAVOR, MILK",
    "picture": "/hd/11_hd.png"
  },
  {
    "key": 12,
    "name": "Chocolate Chocolate Chip Ice Cream",
    "description": "Our chocolate chocolate chip ice cream is the perfect combination of pure, sweet cream, fine cocoa, and chocolate chips. Truly a decadent ice cream experience.",
    "rating": 4.7,
    "rating_count": 46,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, CHOCOLATE, COCOA PROCESSED WITH ALKALI, EGG YOLKS, COCOA BUTTER, VANILLA EXTRACT",
    "picture": "/hd/12_hd.png"
  },
  {
    "key": 13,
    "name": "Chocolate Dark Chocolate Ice Cream Bar",
    "description": "Between the classic rich and creamy chocolate ice cream inside, and the thick and crunchy dark chocolate coating finely drizzled on the outside, this is a chocolate connoisseur's delight.",
    "rating": 4.5,
    "rating_count": 22,
    "ingredients": "CREAM, SKIM MILK, SUGAR, COCOA PROCESSED WITH ALKALI, DARK CHOCOLATE, SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, SOYBEAN OIL",
    "picture": "/hd/13_hd.png"
  },
  {
    "key": 14,
    "name": "Chocolate Fudge Non-Dairy Bar",
    "description": "Enjoy an indulgent non-dairy and vegan bar made from Belgian chocolate, cocoa, and swirls of chocolate fudge that’s finished with a decadent rice milk chocolate coating.",
    "rating": 5,
    "rating_count": 22,
    "ingredients": "WATER, SUGAR, CORN SYRUP, CHOCOLATE, COCONUT OIL, POWDERED SUGAR, SUGAR, CORN STARCH, COCOA BUTTER, SUNFLOWER OIL, COCOA PROCESSED WITH ALKALI, COCOA, SOYBEAN OIL, SOY LECITHIN, PECTIN, VANILLA EXTRACT, SALT, SUNFLOWER LECITHIN",
    "picture": "/hd/14_hd.png"
  },
  {
    "key": 15,
    "name": "Chocolate Peanut Butter Ice Cream",
    "description": "We start with our legendary chocolate ice cream and swirl in ribbons of creamy, smooth peanut butter. The experience is an irresistible blend of flavors in every delicious mouthful.",
    "rating": 4.2,
    "rating_count": 173,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, PEANUTS, EGG YOLKS, CHOCOLATE, COCOA PROCESSED WITH ALKALI, PEANUT OIL, SALT",
    "picture": "/hd/15_hd.png"
  },
  {
    "key": 16,
    "name": "Chocolate Salted Fudge Truffle Non-Dairy",
    "description": "Rich Belgian chocolate is blended with swirls of sweet salted fudge and chunks of fudge truffles to create an incredible non-dairy and vegan indulgence that isn't missing a thing.",
    "rating": 4.8,
    "rating_count": 97,
    "ingredients": "WATER, SUGAR, CORN SYRUP, BELGIAN CHOCOLATE, POWDERED SUGAR, SUGAR, CORN STARCH, COCOA PROCESSED WITH ALKALI, SUNFLOWER OIL, COCOA, COCONUT OIL, SOYBEAN OIL, SOY LECITHIN, PECTIN, VANILLA EXTRACT, SALT, NATURAL FLAVOR, SUNFLOWER LECITHIN",
    "picture": "/hd/16_hd.png"
  },
  {
    "key": 17,
    "name": "Chocolate Sea Salt Caramel HEAVEN Light Ice Cream",
    "description": "Introducing new HEAVEN Chocolate Sea Salt Caramel light ice cream. Sink your spoon into dreamy chocolate light ice cream swirled with a ribbon of decadent sea salt caramel.",
    "rating": 4.1,
    "rating_count": 13,
    "ingredients": "SKIM MILK, CANE SUGAR, CREAM, COCOA PROCESSED WITH ALKALI, EGG YOLKS, CORN SYRUP, SWEETENED CONDENSED MILK, CONDENSED MILK, CANE SUGAR, BUTTER, CREAM, SALT, PECTIN, SEA SALT, SUNFLOWER LECITHIN, BAKING SODA, VITAMIN A PALMITATE",
    "picture": "/hd/17_hd.png"
  },
  {
    "key": 18,
    "name": "Coconut Caramel Non-Dairy",
    "description": "This one-of-a-kind non-dairy and vegan creation gives you more of what you love. Enjoy an irresistible combination of creamy coconut and ribbons of luscious caramel.",
    "rating": 4.9,
    "rating_count": 11,
    "ingredients": "COCONUT CREAM (COCONUT EXTRACT, WATER), CORN SYRUP, WATER, SUGAR, PECTIN. CARAMEL SWIRL: BROWN SUGAR, COCONUT CREAM (COCONUT EXTRACT, WATER), WATER, SALT, PECTIN",
    "picture": "/hd/18_hd.png"
  },
  {
    "key": 19,
    "name": "Coconut Caramel Chocolate TRIO CRISPY LAYERS",
    "description": "Layers of creamy coconut and chocolate ice cream mingle with crisp Belgian milk chocolate and luscious caramel sauce for three times the indulgence.",
    "rating": 4.6,
    "rating_count": 26,
    "ingredients": "SKIM MILK, SUGAR, EGG YOLKS, COCONUT CREAM, CORN STARCH, NATURAL FLAVOR, LEMON JUICE CONCENTRATE, CREAM, SKIM MILK, SUGAR, COCOA PROCESSED WITH ALKALI, SUGAR, COCONUT OIL, SOY LECITHIN, CORN SYRUP, SWEETENED CONDENSED MILK, CONDENSED MILK, SUGAR, CREAM, SUGAR, WATER, BUTTER, CREAM, SALT, SALT, PECTIN, SOY LECITHIN",
    "picture": "/hd/19_hd.png"
  },
  {
    "key": 20,
    "name": "Coconut Caramel Dark Chocolate Non-Dairy Bar",
    "description": "Velvety coconut cream is swirled with ribbons of luscious caramel sauce, then dipped in dark chocolate and finished with a rich, dark chocolate drizzle. It raises the bar for non-dairy and vegan indulgence.",
    "rating": 4.6,
    "rating_count": 31,
    "ingredients": "COCONUT CREAM, COCONUT EXTRACT, WATER, CORN SYRUP, WATER, SUGAR, DARK CHOCOLATE, SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, BROWN SUGAR, COCONUT CREAM, COCONUT EXTRACT, WATER, WATER, COCONUT OIL, PECTIN, SALT",
    "picture": "/hd/20_hd.png"
  },
  {
    "key": 21,
    "name": "Coffee Ice Cream",
    "description": "We roast the finest Brazilian coffee beans and brew them to perfection to bring out their rich, complex flavor. the combination of the brew with our pure, creamy ice cream awakens the senses.",
    "rating": 4.6,
    "rating_count": 173,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, COFFEE",
    "picture": "/hd/21_hd.png"
  },
  {
    "key": 22,
    "name": "Coffee Almond Crunch Ice Cream Bar",
    "description": "Coffee ice cream bar dipped in rich milk chocolate and almonds.",
    "rating": 4.3,
    "rating_count": 42,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, MILK CHOCOLATE, SUGAR, WHOLE MILK POWDER, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, ALMONDS ROASTED IN VEGETABLE OIL, ALMONDS, SAFFLOWER OIL, TOFFEE, CORN SYRUP, SUGAR, BUTTER, CREAM, SALT, BROWN SUGAR, ALMONDS, BAKING SODA, SOY LECITHIN, SALT",
    "picture": "/hd/22_hd.png"
  },
  {
    "key": 23,
    "name": "Coffee Chip Ice Cream",
    "description": "We took our beloved Java Chip Ice Cream and made its famous coffee taste even better. Rich, sweet chocolaty chips balance our full-bodied coffee ice cream in this delicious homage to one of life's most perfect pairings.",
    "rating": 3.1,
    "rating_count": 111,
    "ingredients": "CREAM, SKIM MILK, SUGAR, POWDERED SUGAR, SUGAR, CORN STARCH, EGG YOLKS, COCONUT OIL, COFFEE, COCOA PROCESSED WITH ALKALI, BUTTER OIL, SOY LECITHIN, NATURAL FLAVOR, MILK",
    "picture": "/hd/23_hd.png"
  },
  {
    "key": 24,
    "name": "Coffee Vanilla Chocolate TRIO CRISPY LAYERS",
    "description": "The rich complexity of our classic coffee ice cream paired with silky vanilla ice cream and an indulgent Belgian chocolate crunch.",
    "rating": 4.4,
    "rating_count": 48,
    "ingredients": "VANILLA ICE CREAM, CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, VANILLA EXTRACT, COFFEE ICE CREAM, CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, COFFEE, SUGAR, COCONUT OIL, WHOLE MILK POWDER, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT",
    "picture": "/hd/24_hd.png"
  },
  {
    "key": 25,
    "name": "Cold Brew Espresso Chip HEAVEN Light Ice Cream",
    "description": "Introducing new HEAVEN Cold Brew Espresso Chip light ice cream. Take a break with this rich and flavorful coffee light ice cream with a burst of chocolate espresso chips.",
    "rating": 4.5,
    "rating_count": 18,
    "ingredients": "SKIM MILK, CREAM, CANE SUGAR, CHOCOLATE, CANE SUGAR, COCOA BUTTER, MILKFAT, SOY LECITHIN, VANILLA EXTRACT, EGG YOLKS, COCONUT OIL, COFFEE, VITAMIN A PALMITATE",
    "picture": "/hd/25_hd.png"
  },
  {
    "key": 26,
    "name": "Cookies and Cream Ice Cream",
    "description": "Pieces of rich, chocolaty cookies are dunked in delicious, creamy vanilla ice cream to satisfy the milk-and-cookies kid in all of us.",
    "rating": 4.6,
    "rating_count": 23,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, WHEAT FLOUR, VANILLA EXTRACT, COCOA PROCESSED WITH ALKALI, COCONUT OIL, BAKING SODA, CHOCOLATE, SALT",
    "picture": "/hd/26_hd.png"
  },
  {
    "key": 27,
    "name": "Double Belgian Chocolate Chip Ice Cream",
    "description": "Your favorite Belgian chocolate ice cream, renamed. Our Belgian chocolate combines rich, velvety chocolate ice cream with finely shaved Belgian chocolate for a uniquely textured experience.",
    "rating": 4.8,
    "rating_count": 158,
    "ingredients": "CHOCOLATE ICE CREAM: CREAM, SKIM MILK, DARK CHOCOLATE (BELGIAN CHOCOLATE, SUGAR, COCOA BUTTER, SOY LECITHIN, VANILLA), SUGAR, EGG YOLKS, COCOA PROCESSED WITH ALKALI, VANILLA EXTRACT. CHOCOLATE CHUNKS WITH VEGETABLE OIL: BELGIAN CHOCOLATE (SUGAR, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, NATURAL FLAVOR), COTTONSEED OIL, COCONUT OIL. CONTAINS: MILK, EGG AND SOY INGREDIENTS",
    "picture": "/hd/27_hd.png"
  },
  {
    "key": 28,
    "name": "Dulce de Leche Cookie Squares",
    "description": "A rich dark chocolate cookie topped with dulce de leche ice cream and swirls of luscious caramel coated in a milk chocolate shell with a drizzle of dark chocolate.",
    "rating": 3.9,
    "rating_count": 35,
    "ingredients": "ULCE DE LECHE ICE CREAM: CREAM, SKIM MILK, SUGAR, SWEETENED CONDENSED MILK (MILK,SUGAR), EGG YOLKS, CORN SYRUP, BAKING SODA, SALT, VANILLA EXTRACT. MILK CHOCOLATE AND VEGETABLE OIL COATING: MILK CHOCOLATE (SUGAR, WHOLE MILK POWDER, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT), COCONUT OIL. CHOCOLATE COOKIE: BLEACHED WHEAT FLOUR, SUGAR, PALM OIL, COCOA PROCESSED WITH ALKALI, CORN SYRUP, MOLASSES, BAKING SODA, SALT, SOY LECITHIN. CARAMEL SWIRL: SWEETENED CONDENSED MILK (MILK, SUGAR), SUGAR, WATER, CORN SYRUP, COCONUT OIL, PECTIN, SOY LECITHIN, SALT, BAKING SODA, VANILLA EXTRACT. DARK CHOCOLATE DRIZZLE WITH VEGETABLE OIL: DARK CHOCOLATE (SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT), COCONUT OIL, SOYBEAN OIL",
    "picture": "/hd/28_hd.png"
  },
  {
    "key": 29,
    "name": "Dulce de Leche Ice Cream",
    "description": "Inspired by Latin America's treasured dessert, our dulce de leche ice cream is a delicious combination of caramel and sweet cream, swirled with ribbons of golden caramel.",
    "rating": 4.8,
    "rating_count": 209,
    "ingredients": "CREAM, SKIM MILK, SUGAR, SWEETENED CONDENSED MILK, CONDENSED MILK, SUGAR, EGG YOLKS, CORN SYRUP, COCONUT OIL, PECTIN, SOY LECITHIN, SALT, BAKING SODA, VANILLA EXTRACT",
    "picture": "/hd/29_hd.png"
  },
  {
    "key": 30,
    "name": "Green Tea Ice Cream",
    "description": "We make our green tea ice cream from a highly sought-after Japanese matcha green tea, a ceremonial tea prized for its intense yet delicate essence. enjoy its soothing flavor enhanced with the richness of pure, sweet cream.",
    "rating": 4.2,
    "rating_count": 109,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, GREEN TEA",
    "picture": "/hd/30_hd.png"
  },
  {
    "key": 31,
    "name": "Honey Salted Caramel Almond Ice Cream",
    "description": "This decadent blend of honey ice cream, swirls of salted caramel, and crunchy toasted almonds was lovingly crafted to raise awareness for the honeybees and other pollinators who bring us so many of our favorite ingredients.",
    "rating": 5,
    "rating_count": 103,
    "ingredients": "CREAM, SKIM MILK, SUGAR, SWEETENED CONDENSED MILK, CONDENSED MILK, SUGAR, CORN SYRUP, EGG YOLKS, HONEY, BUTTER, CREAM, SALT, SALT, SAFFLOWER OIL, VANILLA EXTRACT, PECTIN, BAKING SODA",
    "picture": "/hd/31_hd.png"
  },
  {
    "key": 32,
    "name": "Irish Cream Cookie Squares",
    "description": "A rich chocolate cookie topped with ice cream that’s infused with Irish Cream before the entire square is dipped in decadent dark chocolate.",
    "rating": 4.9,
    "rating_count": 14,
    "ingredients": "CREAM, SKIM MILK, SUGAR, CORN SYRUP, EGG YOLKS, COFFEE, BOURBON, COCOA, SALT, DARK CHOCOLATE, SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, BLEACHED WHEAT FLOUR, SUGAR, PALM OIL, CORN SYRUP, COCOA PROCESSED WITH ALKALI, MOLASSES, BAKING SODA, SALT, SUGAR, CORN STARCH, SUNFLOWER OIL, COCOA, SALT, SUGAR, COCOA BUTTER, SKIM MILK, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL",
    "picture": "/hd/32_hd.png"
  },
  {
    "key": 33,
    "name": "Irish Cream Brownie Ice Cream",
    "description": "Irish Cream infused into our ice cream with rich chocolate brownie pieces and a decadent fudge swirl.",
    "rating": 4.3,
    "rating_count": 85,
    "ingredients": "CREAM, SKIM MILK, SUGAR, CORN SYRUP, POWDERED SUGAR, SUGAR, CORN STARCH, EGG YOLKS, SUNFLOWER OIL, COCOA, WHEAT FLOUR, COCOA PROCESSED WITH ALKALI, SOYBEAN OIL, COFFEE, CORN STARCH, EGGS, SALT, NATURAL FLAVORS, SUNFLOWER LECITHIN, BAKING SODA",
    "picture": "/hd/33_hd.png"
  },
  {
    "key": 34,
    "name": "Lemon Sorbet",
    "description": "Juicy, sun-ripened lemons create a tart yet sweet fruit sorbet. An indulgent treat with a delicate flavor that dazzles your tongue and refreshes your senses.",
    "rating": 4.8,
    "rating_count": 17,
    "ingredients": "WATER, SUGAR, CORN SYRUP, LEMON JUICE CONCENTRATE, PECTIN, NATURAL FLAVOR, CITRIC ACID",
    "picture": "/hd/34_hd.png"
  },
  {
    "key": 35,
    "name": "Lemon Raspberry White Chocolate TRIO CRISPY LAYERS",
    "description": "Our Lemon Raspberry White Chocolate TRIO Crispy Layers weaves lemon and raspberry ice creams between perfectly crispy white chocolate and sweet raspberry sauce for a uniquely tantilizing treat.",
    "rating": 4.3,
    "rating_count": 51,
    "ingredients": "CREAM, SKIM MILK, SUGAR, RASPBERRY PUREE, EGG YOLKS, LEMON JUICE CONCENTRATE, NATURAL FLAVOR, CREAM, SKIM MILK, SUGAR, EGG YOLKS, CORN SYRUP, LEMON JUICE CONCENTRATE, SUGAR, COCOA BUTTER, NONFAT DRY MILK, COCONUT OIL, SKIM MILK, SOY LECITHIN, RASPBERRY PUREE, SUGAR, WATER, LEMON JUICE CONCENTRATE, PECTIN, NATURAL FLAVOR",
    "picture": "/hd/35_hd.png"
  },
  {
    "key": 36,
    "name": "Mango Ice Cream",
    "description": "Our ode to the tropical flavors of South America combines sweet mango ice cream and slices of juicy mango for a simply perfect treat.",
    "rating": 4.8,
    "rating_count": 44,
    "ingredients": "CREAM, SKIM MILK, SUGAR, MANGO PUREE, MANGO, CORN SYRUP, EGG YOLKS, PECTIN, ORANGE JUICE CONCENTRATE, NATURAL FLAVOR, LEMON JUICE CONCENTRATE",
    "picture": "/hd/36_hd.png"
  },
  {
    "key": 37,
    "name": "Mango Sorbet",
    "description": "We blended juicy, tropical mangos into a smooth puree to create a refreshing treat with sweet fruit intensity.",
    "rating": 4.6,
    "rating_count": 20,
    "ingredients": "WATER, SUGAR, MANGO PUREE, NATURAL FLAVOR, CARROT JUICE CONCENTRATE, LEMON JUICE CONCENTRATE, PUMPKIN JUICE CONCENTRATE, PECTIN",
    "picture": "/hd/37_hd.png"
  },
  {
    "key": 38,
    "name": "Mint Chip Ice Cream",
    "description": "We infuse mint essence into a smooth, creamy base and add rich chocolaty chips for the perfect finish to this refreshingly cool treat.",
    "rating": 3.4,
    "rating_count": 35,
    "ingredients": "CREAM, SKIM MILK, SUGAR, LACTOSE REDUCED SKIM MILK, CORN SYRUP, EGG YOLKS, COCONUT OIL, COCOA POWDER, BUTTER OIL, SOY LECITHIN, NATURAL FLAVOR, SALT, MILK",
    "picture": "/hd/38_hd.png"
  },
  {
    "key": 39,
    "name": "Peanut Butter Cookie Squares",
    "description": "A chocolate cookie topped with our delicious peanut butter ice cream swirled with more creamy peanut butter, then dipped in milk chocolate and drizzled with a dark chocolate.",
    "rating": 4.4,
    "rating_count": 14,
    "ingredients": "CREAM, SKIM MILK, SUGAR, PEANUTS, EGG YOLKS, PEANUT OIL, COCONUT OIL, MILK CHOCOLATE, SUGAR, WHOLE MILK POWDER, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT, BLEACHED WHEAT FLOUR, SUGAR, PALM OIL, CORN SYRUP, COCOA PROCESSED WITH ALKALI, MOLASSES, BAKING SODA, SALT, PEANUTS, SUGAR, PEANUT OIL, DARK CHOCOLATE, SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, SOYBEAN OIL",
    "picture": "/hd/39_hd.png"
  },
  {
    "key": 40,
    "name": "Peanut Butter Chip HEAVEN Light Ice Cream",
    "description": "Introducing new HEAVEN Peanut Butter Chip light ice cream. Satisfy your sweet tooth with vanilla light ice cream, a swirl of creamy peanut butter, and the satisfying crunch of chocolate chips.",
    "rating": 2.7,
    "rating_count": 25,
    "ingredients": "SKIM MILK, CREAM, CANE SUGAR, PEANUTS, EGG YOLKS, CHOCOLATE, COCOA BUTTER, PEANUT OIL, VANILLA EXTRACT, SALT, VITAMIN A PALMITATE",
    "picture": "/hd/40_hd.png"
  },
  {
    "key": 41,
    "name": "Peanut Butter Chocolate Fudge Non-Dairy",
    "description": "Instead of distracting dairy substitutes, we mix the creamiest peanut butter with ribbons of rich chocolate fudge and crunchy peanuts. It's the ultimate indulgence that just happens to be non-dairy and vegan.",
    "rating": 4.6,
    "rating_count": 24,
    "ingredients": "WATER, CORN SYRUP, SUGAR, PEANUTS, POWDERED SUGAR, SUGAR, CORN STARCH, SUNFLOWER OIL, COCOA, PEANUT OIL, COCONUT OIL, PECTIN, SALT, SUNFLOWER LECITHIN",
    "picture": "/hd/41_hd.png"
  },
  {
    "key": 42,
    "name": "Peanut Butter Chocolate Fudge Non-Dairy Bar",
    "description": "Smooth peanut butter is swirled with decadent chocolate fudge then coated in crisp dark chocolate and a dark chocolate drizzle for a playfully pure non-dairy and vegan indulgence.",
    "rating": 4.8,
    "rating_count": 32,
    "ingredients": "PEANUT BUTTER FROZEN DESSERT: WATER, CORN SYRUP, SUGAR, PEANUTS, PEANUT OIL, COCONUT OIL, PECTIN, SALT. DARK CHOCOLATE AND VEGETABLE OIL COATING: DARK CHOCOLATE (SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT), COCONUT OIL, SOYBEAN OIL. SALTED FUDGE SWIRL: POWDERED CANE SUGAR (CANE SUGAR, CORN STARCH), SUNFLOWER OIL, COCOA, SALT, SUNFLOWER LECITHIN",
    "picture": "/hd/42_hd.png"
  },
  {
    "key": 43,
    "name": "Peppermint Bark Ice Cream",
    "description": "Celebrate the season with our rendition of this holiday classic. Rich white chocolate ice cream is blended with crunchy chocolaty peppermint bark and peppermint candy pieces.",
    "rating": 5,
    "rating_count": 31,
    "ingredients": "WHITE CHOCOLATE ICE CREAM (CREAM, SKIM MILK, SUGAR, CORN SYRUP, EGG YOLKS, NATURAL FLAVOR, COCOA BUTTER), PEPPERMINT BARK PIECES (SUGAR, COCONUT OIL, COCOA PROCESSED WITH ALKALI, NONFAT DRY MILK, BUTTERFAT, COCOA, SOY LECITHIN, NATURAL FLAVOR, SALT, CORN SYRUP, VEGETABLE JUICE (FOR COLOR), PEPPERMINT OIL), PEPPERMINT TWISTS CANDY (SUGAR, CORN SYRUP, PALM KERNEL OIL, VEGETABLE JUICE (FOR COLOR), PEPPERMINT OIL, SOY LECITHIN)",
    "picture": "/hd/43_hd.png"
  },
  {
    "key": 44,
    "name": "Peppermint Bark Ice Cream Bar",
    "description": "Our peppermint bark ice cream bars start with decadent white chocolate ice cream, dipped in thick, dark chocolate, then speckled with cool peppermint candy pieces.",
    "rating": 5,
    "rating_count": 8,
    "ingredients": "WHITE CHOCOLATE ICE CREAM: CREAM, SKIM MILK, SUGAR, CORN SYRUP, EGG YOLKS, NATURAL FLAVOR, COCOA BUTTER. DARK CHOCOLATE AND VEGETABLE OIL COATING WITH PEPPERMINT CANDY PIECES: DARK CHOCOLATE (SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT), PEPPERMINT CANDY PIECES: (SUGAR, CORN SYRUP, COCONUT OIL, NATURAL FLAVOR, SOY LECITHIN), COCONUT OIL, SOYBEAN OIL",
    "picture": "/hd/44_hd.png"
  },
  {
    "key": 45,
    "name": "Pineapple Coconut Ice Cream",
    "description": "Let us take you on a voyage to a tropical island where exotic fruits ripen in the golden sun. We combine pure, sweet cream, tropical pineapple, and delectable coconut flavor for a truly indulgent ice cream experience.",
    "rating": 4.5,
    "rating_count": 105,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, PINEAPPLE, EGG YOLKS, NATURAL FLAVOR, RUM, SALT",
    "picture": "/hd/45_hd.png"
  },
  {
    "key": 46,
    "name": "Pistachio Ice Cream",
    "description": "Its exotic flavor is the hallmark of this remarkable dessert. roasted pistachio nuts gently mixed with pure sweet cream brings out the best in this pairing.",
    "rating": 3.8,
    "rating_count": 64,
    "ingredients": "WEET CREAM ICE CREAM: CREAM, SKIM MILK, SUGAR, LACTOSE REDUCED SKIM MILK, CORN SYRUP, EGG YOLKS, SALT. ROASTED PISTACHIOS: PISTACHIOS, SAFFLOWER OIL",
    "picture": "/hd/46_hd.png"
  },
  {
    "key": 47,
    "name": "Raspberry Sorbet",
    "description": "We blended delicious, ripe raspberries into a smooth puree for this tangy yet sweet fruit sorbet. It's refreshing and smooth with a sweet flavor intensity.",
    "rating": 4.5,
    "rating_count": 14,
    "ingredients": "WATER, SUGAR, RASPBERRY PUREE, CORN SYRUP, PECTIN, LEMON JUICE CONCENTRATE",
    "picture": "/hd/47_hd.png"
  },
  {
    "key": 48,
    "name": "Rocky Road Ice Cream",
    "description": "Velvety swirls of marshmallow, roasted almonds, and our legendary chocolate ice cream come together in this playful ice cream delight.",
    "rating": 4.6,
    "rating_count": 29,
    "ingredients": "CREAM, SKIM MILK, SUGAR, CORN SYRUP, COCOA PROCESSED WITH ALKALI, EGG YOLKS, CORN STARCH, SAFFLOWER OIL, EGG WHITES, CREAM OF TARTAR, SALT, PECTIN, NATURAL FLAVOR",
    "picture": "/hd/48_hd.png"
  },
  {
    "key": 49,
    "name": "Rosé & Cream Ice Cream",
    "description": "Indulge in this new wine infused sweet cream ice cream folded together with a refreshingly tart Rosé flavored swirl.\n*Contains Less Than 0.5% Alcohol by Volume",
    "rating": 4.4,
    "rating_count": 23,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, GRAPE JUICE CONCENTRATE, NATURAL FLAVOR, CITRIC ACID, WINE, SALT, PECTIN",
    "picture": "/hd/49_hd.png"
  },
  {
    "key": 50,
    "name": "Ruby Cacao Ice Cream Bar",
    "description": "Indulge in the decadent crunch of a ruby cacao shell and our creamy sweet cream ice cream, for a sensorial experience of luscious smoothness with berry fruity notes.",
    "rating": 3.5,
    "rating_count": 31,
    "ingredients": "CREAM, SKIM MILK, SUGAR, COCOA BUTTER, WHOLE MILK POWDER, EGG YOLKS, CHOCOLATE, MILKFAT, CITRIC ACID, SOY LECITHIN.\nCONTAINS: MILK, EGG AND SOY INGREDIENTS",
    "picture": "/hd/50_hd.png"
  },
  {
    "key": 51,
    "name": "Ruby Cacao Crackle Pistachio Sweet Cream TRIO CRISPY LAYERS",
    "description": "Crispy and rich ruby cacao layers complement our smooth pistachio and sweet cream ice cream in this sensorial delight.",
    "rating": 4,
    "rating_count": 46,
    "ingredients": "CREAM, SKIM MILK, SUGAR, CORN SYRUP, EGG YOLKS, COCOA BUTTER, WHOLE MILK POWDER, PISTACHIO PASTE, CHOCOLATE, MILKFAT, NATURAL FLAVOR, SOY LECITHIN, CITRIC ACID, VEGETABLE JUICE CONCENTRATE COLOR.\nCONTAINS: MILK, EGG, PISTACHIOS AND SOY INGREDIENTS",
    "picture": "/hd/51_hd.png"
  },
  {
    "key": 52,
    "name": "Rum Raisin Ice Cream",
    "description": "We soak plump raisins in rum and add pure, sweet cream for a rich, flavorful experience infused with just the right hint of warmth.",
    "rating": 3.5,
    "rating_count": 129,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, RAISINS, EGG YOLKS, RUM",
    "picture": "/hd/52_hd.png"
  },
  {
    "key": 53,
    "name": "Rum Tres Leches Ice Cream",
    "description": "A Latin American inspired indulgence, we infuse smooth white Rum into our ice cream then add thick ribbons of dulce de leche and chunks of sweet Tres Leches cake.",
    "rating": 4,
    "rating_count": 97,
    "ingredients": "CREAM, SKIM MILK, SUGAR, SWEETENED CONDENSED MILK, CONDENSED MILK, SUGAR, EGG YOLKS, CORN SYRUP, WHEAT FLOUR, PALM OIL, RUM, EGGS, COCONUT OIL, PECTIN, SOY LECITHIN, EVAPORATED MILK, SALT, SOYBEAN OIL, BAKING SODA, NATURAL FLAVORS, POWDERED SUGAR, SUGAR, CORN STARCH",
    "picture": "/hd/53_hd.png"
  },
  {
    "key": 54,
    "name": "Salted Caramel Chocolate TRIO CRISPY LAYERS",
    "description": "Journey through layers of lightly salted caramel ice cream and irresistible chocolate ice cream stacked between crisp Belgian chocolate for an unmistakably sophisticated sweetness.",
    "rating": 3.4,
    "rating_count": 55,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, COCOA PROCESSED WITH ALKALI, CREAM, SKIM MILK, CANE SUGAR, SWEETENED CONDENSED MILK, MILK, CANE SUGAR, CORN SYRUP, EGG YOLKS, CARAMELIZED SUGAR, CANE SUGAR, WATER, SEA SALT, BAKING SODA, SOY LECITHIN, VANILLA EXTRACT, SUGAR, COCONUT OIL, WHOLE MILK POWDER, COCOA BUTTER, SOY LECITHIN",
    "picture": "/hd/54_hd.png"
  },
  {
    "key": 55,
    "name": "Strawberry Ice Cream",
    "description": "We introduce sweet summer strawberries to pure cream and other natural ingredients. Because it's brimming with real fruit, the true flavor of our strawberries comes shining through.",
    "rating": 4.8,
    "rating_count": 108,
    "ingredients": "CREAM, SKIM MILK, STRAWBERRIES, CANE SUGAR, EGG YOLKS",
    "picture": "/hd/55_hd.png"
  },
  {
    "key": 56,
    "name": "Strawberry Waffle Cone HEAVEN Light Ice Cream",
    "description": "Introducing new HEAVEN Strawberry Waffle Cone light ice cream. Delight in the sweet taste of strawberry light ice cream dappled with crunchy pieces of chocolate-covered waffle cone.",
    "rating": 4.2,
    "rating_count": 18,
    "ingredients": "CANE SUGAR, SKIM MILK, STRAWBERRIES, CREAM, CHOCOLATY COATED CONE PIECES, COCONUT OIL, CANE SUGAR, WAFFLE CONE PIECES, WHEAT FLOUR, CANE SUGAR, SOYBEAN OIL, SOY LECITHIN, NATURAL FLAVOR, SALT, COCOA PROCESSED WITH ALKALI, VANILLA EXTRACT, EGG YOLKS, PECTIN, VITAMIN A PALMITATE",
    "picture": "/hd/56_hd.png"
  },
  {
    "key": 57,
    "name": "Triple Chocolate TRIO CRISPY LAYERS",
    "description": "Velvety white chocolate ice cream complemented by smooth milk chocolate ice cream with the delightful crunch of crispy Belgian chocolate layers. At last, the joy of chocolate without having to choose.",
    "rating": 3.9,
    "rating_count": 52,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, COCOA BUTTER, CREAM, SKIM MILK, CANE SUGAR, COCOA PROCESSED WITH ALKALI, SUGAR, COCONUT OIL, SOY LECITHIN, VANILLA EXTRACT",
    "picture": "/hd/57_hd.png"
  },
  {
    "key": 58,
    "name": "Vanilla Cookie Squares",
    "description": "A dark chocolate cookie gets even more decadent when it's topped with our signature vanilla ice cream then dipped in a dark chocolate shell and a milk chocolate drizzle.",
    "rating": 4.3,
    "rating_count": 32,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, DARK CHOCOLATE, SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, BLEACHED WHEAT FLOUR, SUGAR, PALM OIL, COCOA PROCESSED WITH ALKALI, CORN SYRUP, MOLASSES, BAKING SODA, SALT, MILK CHOCOLATE, SUGAR, WHOLE MILK POWDER, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT",
    "picture": "/hd/58_hd.png"
  },
  {
    "key": 59,
    "name": "Vanilla Ice Cream",
    "description": "Vanilla is the essence of elegance and sophistication. This marriage of pure, sweet cream and Madagascar vanilla creates the sweet scent of exotic spice and a distinctive taste that lingers on your tongue.",
    "rating": 3,
    "rating_count": 228,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, VANILLA EXTRACT",
    "picture": "/hd/59_hd.png"
  },
  {
    "key": 60,
    "name": "Vanilla Soft Dipped Ice Cream Bar",
    "description": "Introducing Soft Dipped Ice Cream Bars, a luscious combination of creamy vanilla ice cream covered in a soft chocolate truffle coating - the ultimate luxurious taste sensation.",
    "rating": 4.4,
    "rating_count": 13,
    "ingredients": "VANILLA ICE CREAM: CREAM, SKIM MILK, SUGAR, EGG YOLKS, VANILLA EXTRACT. CHOCOLATY COATING: SUGAR, COCOA PROCESSED WITH ALKALI, CANOLA OIL, PALM OIL, SOY LECITHIN.\nCONTAINS: MILK, EGG AND SOY INGREDIENTS",
    "picture": "/hd/60_hd.png"
  },
  {
    "key": 61,
    "name": "Vanilla Bean Ice Cream",
    "description": "a unique twist to our iconic flavor. our ice cream blends Madagascar vanilla and pure, sweet cream with flecks of real vanilla beans, for a spicy and sweet delight.",
    "rating": 4.5,
    "rating_count": 115,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, GROUND VANILLA BEANS, VANILLA EXTRACT",
    "picture": "/hd/61_hd.png"
  },
  {
    "key": 62,
    "name": "Vanilla Blackberry Chocolate TRIO CRISPY LAYERS",
    "description": "It begins with the classic taste of pure vanilla ice cream then, one layer of crispy Belgian chocolate later, becomes the vine-ripened intensity of blackberry ice cream.",
    "rating": 4.3,
    "rating_count": 74,
    "ingredients": "CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, CREAM, SKIM MILK, CANE SUGAR, EGG YOLKS, NATURAL FLAVOR, LEMON JUICE CONCENTRATE, SUGAR, COCONUT OIL, SOY LECITHIN",
    "picture": "/hd/62_hd.png"
  },
  {
    "key": 63,
    "name": "Vanilla Caramel White Chocolate TRIO CRISPY LAYERS",
    "description": "This incredible combination of tastes and textures combines layers of vanilla and caramel ice cream with crunchy white chocolate and sweet caramel sauce.",
    "rating": 5,
    "rating_count": 32,
    "ingredients": "CREAM, SKIM MILK, SUGAR, SWEETENED CONDENSED MILK, CONDENSED MILK, SUGAR, CORN SYRUP, EGG YOLKS, CARAMELIZED SUGAR, SUGAR, WATER, SEA SALT, BAKING SODA, SOY LECITHIN, VANILLA EXTRACT, CREAM, SKIM MILK, SUGAR, EGG YOLKS, SUGAR, COCOA BUTTER, NONFAT DRY MILK, COCONUT OIL, SKIM MILK, SOY LECITHIN, CORN SYRUP, SWEETENED CONDENSED MILK, CONDENSED MILK, SUGAR, CREAM, SUGAR, WATER, BUTTER, CREAM, SALT, SALT, PECTIN, SOY LECITHIN",
    "picture": "/hd/63_hd.png"
  },
  {
    "key": 64,
    "name": "Vanilla Chocolate Chip Ice Cream",
    "description": "Our delectable chocolate chips are swirled with our creamy, smooth vanilla ice cream, allowing two flavor titans to come together in this classically indulgent treat.",
    "rating": 4.5,
    "rating_count": 46,
    "ingredients": "CREAM, SKIM MILK, SUGAR, LACTOSE REDUCED SKIM MILK, CHOCOLATE, CORN SYRUP, EGG YOLKS, COCOA BUTTER, SALT, VANILLA EXTRACT",
    "picture": "/hd/64_hd.png"
  },
  {
    "key": 65,
    "name": "Vanilla Milk Chocolate Ice Cream Bar",
    "description": "Pure, sweet vanilla blends with sweet cream to make our incredibly smooth vanilla ice cream. Dipped in a milk chocolate coating and drizzled with fine milk chocolate, it's so thick and delicious you'll find it impossible to resist.",
    "rating": 4.6,
    "rating_count": 76,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, VANILLA EXTRACT, MILK CHOCOLATE, SUGAR, WHOLE MILK POWDER, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL",
    "picture": "/hd/65_hd.png"
  },
  {
    "key": 66,
    "name": "Vanilla Milk Chocolate Almond Ice Cream Bar",
    "description": "We start with pure, sweet vanilla and blend it with sweet, fresh cream to make our incredibly smooth vanilla ice cream. Then we dip it in a crunchy roasted almond and milk chocolate coating.",
    "rating": 2.5,
    "rating_count": 224,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, MILK CHOCOLATE, SUGAR, WHOLE MILK POWDER, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT, ALMONDS ROASTED IN VEGETABLE OIL, SAFFLOWER OIL, COCONUT OIL",
    "picture": "/hd/66_hd.png"
  },
  {
    "key": 67,
    "name": "Vanilla Swiss Almond Ice Cream",
    "description": "An almond lover's delight. Our dry-roasted almonds are lightly coated with sweet chocolate and combined with our distinctive vanilla ice cream. Simple yet perfect.",
    "rating": 4.3,
    "rating_count": 129,
    "ingredients": "CREAM, SKIM MILK, SUGAR, LACTOSE REDUCED SKIM MILK, CORN SYRUP, EGG YOLKS, CHOCOLATE, COCOA BUTTER, SALT",
    "picture": "/hd/67_hd.png"
  },
  {
    "key": 68,
    "name": "Whiskey Hazelnut Latte Ice Cream",
    "description": "This new spiked latte inspired treat is a delicious whiskey infused coffee ice cream blended with ribbons of hazelnut fudge and chocolate espresso flakes.\n*Contains Less Than 0.5% Alcohol by Volume",
    "rating": 4.5,
    "rating_count": 11,
    "ingredients": "CREAM, SKIM MILK, SUGAR, EGG YOLKS, BROWN SUGAR, COFFEE, MOLASSES, NATURAL FLAVOR, CORN STARCH, POWDERED SUGAR, SOYBEAN OIL, COCOA PROCESSED WITH ALKALI, COCOA BUTTER, SOY LECITHIN, CHOCOLATE, CANE SUGAR, CHOCOLATE, COCOA BUTTER, MILKFAT, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, COFFEE",
    "picture": "/hd/68_hd.png"
  },
  {
    "key": 69,
    "name": "White Chocolate Raspberry Ice Cream Bar",
    "description": "Inspired by a familiar favorite, this bar of smooth white chocolate ice cream with swirls of tart raspberry is dipped in milk chocolate and then sprinkled with dark chocolate. Perfect for getting carried away.",
    "rating": 3.9,
    "rating_count": 11,
    "ingredients": "WHITE CHOCOLATE ICE CREAM, CREAM, SKIM MILK, SUGAR, EGG YOLKS, COCOA BUTTER, NATURAL FLAVOR, MILK CHOCOLATE AND VEGETABLE OIL COATING, MILK CHOCOLATE, SUGAR, WHOLE MILK POWDER, CHOCOLATE, COCOA BUTTER, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, RASPBERRY SWIRL, RASPBERRY PUREE, SUGAR, WATER, LEMON JUICE CONCENTRATE, PECTIN, NATURAL FLAVOR, DARK CHOCOLATE, SUGAR, CHOCOLATE, SOY LECITHIN, VANILLA EXTRACT, COCONUT OIL, SOYBEAN OIL",
    "picture": "/hd/69_hd.png"
  }
]