[
  {
    "key": 0,
    "name": "Salted Caramel Core",
    "subhead": "Sweet Cream Ice Cream with Blonde Brownies & a Salted Caramel Core",
    "description": "Find your way to the ultimate ice cream experience with our Cores. Whether your primal urges lead you to the center of salted caramel or directly to the blonde brownies, you’ll be in total control of your own ice cream destiny.",
    "rating": 3.7,
    "rating_count": 208,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, BROWN SUGAR, SUGAR, MILK, WHEAT FLOUR, EGG YOLKS, CORN SYRUP, EGGS, BUTTER (CREAM, SALT), BUTTEROIL, PECTIN, SEA SALT, SOYBEAN OIL, VANILLA EXTRACT, GUAR GUM, SOY LECITHIN, BAKING POWDER (SODIUM ACID PYROPHOSPHATE, SODIUM BICARBONATE, CORN STARCH, MONOCALCIUM PHOSPHATE), BAKING SODA, SALT, CARRAGEENAN, LACTASE"
  },
  {
    "key": 1,
    "name": "Netflix & Chilll'd",
    "subhead": "Peanut Butter Ice Cream with Sweet & Salty Pretzel Swirls & Fudge Brownies",
    "description": "There’s something for everyone to watch on Netflix & flavors for everyone to enjoy from Ben & Jerry’s, so we’ve teamed up to bring you a chillaxing new creation that’s certain to satisfy any sweet or salty snack craving. It’s a flavorful world, and everyone is invited to grab a spoon.",
    "rating": 4,
    "rating_count": 127,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, PEANUTS, WHEAT FLOUR, CANOLA OIL, EGG YOLKS, CORN STARCH, PEANUT OIL, COCOA POWDER, SALT, SOYBEAN OIL, INVERT CANE SUGAR, MILK FAT, EGGS, EGG WHITES, GUAR GUM, SOY LECITHIN, TAPIOCA STARCH, BAKING SODA, CARRAGEENAN, VANILLA EXTRACT, BARLEY MALT, MALTED BARLEY FLOUR"
  },
  {
    "key": 2,
    "name": "Chip Happens",
    "subhead": "A Cold Mess of Chocolate Ice Cream with Fudge Chips & Crunchy Potato Chip Swirls",
    "description": "Sometimes “chip” happens and everything’s a mess, but we Nailed It! with this chip-filled limited batch. When smooth chocolate ice cream meets fudge chips & salty swirls, they pack a serious one-two crunch. The best part? There won’t be anything left to clean up.",
    "rating": 4.7,
    "rating_count": 130,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, COCOA (PROCESSED WITH ALKALI), POTATO, COCONUT OIL, CORN SYRUP SOLIDS, SOYBEAN OIL, EGG YOLKS, RICE STARCH, SUNFLOWER OIL, BARLEY MALT, COCOA POWDER, WHEAT FLOUR, MILK, SALT, SOY LECITHIN, YEAST EXTRACT, NATURAL FLAVOR, GUAR GUM, SEA SALT, MILKFAT, VANILLA EXTRACT, ENZYMES, CARRAGEENAN, BAKING SODA. CONTAINS MILK, EGGS, WHEAT AND SOY"
  },
  {
    "key": 3,
    "name": "Cannoli",
    "subhead": "Mascarpone Ice Cream with Fudge-Covered Pastry Shell Pieces & Mascarpone Swirls",
    "description": "As a Limited Batch that captured the rapture of the classic Sicilian dessert, our Cannoli captivated fans like no other Cannoli could. Now that it’s a full-time flavor, you and your Cannoli can re-capture the rapture all over again.",
    "rating": 3.6,
    "rating_count": 70,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER),  WATER, CORN SYRUP, COCONUT OIL, SUGAR, DRIED CANE SYRUP, EGG YOLKS, WHEAT FLOUR, MILK, COCOA, NATURAL FLAVOR, GUAR GUM, SOY LECITHIN, BUTTER OIL, NATURAL FLAVORS, LOCUST BEAN GUM, SALT, CITRIC ACID, VANILLA BEAN SEEDS, SOYBEAN OIL, TAPIOCA STARCH, LACTIC ACID, CARRAGEENAN"
  },
  {
    "key": 4,
    "name": "Gimme S’more!",
    "subhead": "Toasted Marshmallow Ice Cream with Chocolate Cookie Swirls, Graham Cracker Swirls & Fudge Flakes",
    "description": "It’s a gimme: there’s always room for s’more. And we’re pretty sure you’ll want to make s’more room in your freezer for this ‘shmallowy-rich, graham-good-‘n-chocolatey concoction now that it's full time flavor!.",
    "rating": 4.5,
    "rating_count": 281,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), SUGAR, CANOLA OIL, SOYBEAN OIL, EGG YOLKS, CORN SYRUP, WHEAT FLOUR, COCONUT OIL, CORN STARCH, COCOA (PROCESSED WITH ALKALI), CORN SYRUP SOLIDS, COCOA, GRAHAM FLOUR, SALT, EGG WHITES, BUTTEROIL, TAPIOCA STARCH, GUAR GUM, SOY LECITHIN, BAKING SODA, NATURAL FLAVOR, MOLASSES, HONEY, VANILLA EXTRACT, PECTIN, CARAMELIZED SUGAR SYRUP, CARRAGEENAN"
  },
  {
    "key": 5,
    "name": "Peanut Butter Half Baked",
    "subhead": "Chocolate & Peanut Butter Ice Creams Mixed with Gobs of Peanut Butter Cookie Dough & Fudge Brownies",
    "description": "If you were more than a little bit smitten with half baked’s peanut buttery cousin when it was a Limited Batch, we expect you could be a whole lot smittener now that it’s a full-time flavor. Enjoy!",
    "rating": 4.9,
    "rating_count": 14,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, WHEAT FLOUR, PEANUTS, COCOA (PROCESSED WITH ALKALI), BROWN SUGAR, EGG YOLKS, COCOA POWDER, PEANUT OIL, SOYBEAN OIL, BUTTER (CREAM, SALT), INVERT CANE SUGAR, SALT, CHOCOLATE LIQUOR, EGGS, TAPIOCA FLOUR, PEANUT FLOUR, PEANUT EXTRACT, VANILLA EXTRACT, EGG WHITES, GUAR GUM, COCOA BUTTER, NATURAL FLAVOR, CARRAGEENAN, SOY LECITHIN, BAKING SODA, MALTED BARLEY FLOUR"
  },
  {
    "key": 6,
    "name": "Berry Sweet Mascarpone",
    "subhead": "Blackberry & Mascarpone Ice Creams with Shortbread Cookies & Fudge-Covered Almonds",
    "description": "From the sweet blackberry and crazy creamy mascarpone ice creams to the shortbread cookies and fudge-dunked almonds, you’ll fall in love with this flavor faster than you can say “mass-car-po-nay.”",
    "rating": 4.6,
    "rating_count": 10,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), ROASTED ALMONDS (ALMONDS, PEANUT OIL), DRIED CANE SYRUP, EGG YOLKS, WHEAT FLOUR, COCONUT OIL, BLACKBERRY JUICE CONCENTRATE, BUTTER (CREAM, SALT), SUGAR, COCOA, SOYBEAN OIL, CORN SYRUP, SALT, BUTTEROIL, SOY LECITHIN, VANILLA EXTRACT, EGGS, GUAR GUM, MILK, NATURAL FLAVORS, BAKING SODA, TAPIOCA STARCH, CARRAGEENAN, LACTIC ACID, CITRIC ACID"
  },
  {
    "key": 7,
    "name": "Chocolate Peanut Butter Split",
    "subhead": "Chocolate & Banana Ice Creams with Mini Peanut Butter Cups",
    "description": "We’ve loaded our banana and chocolate ice creams with a chocolatey lot of bite-size PB surprises, so if you find your chocolate-covered, peanut-buttered banana fantasies aren’t fulfilled in every spoonful, we suggest a bigger spoon.",
    "rating": 5,
    "rating_count": 7,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, PEANUTS, COCONUT OIL, BANANA PUREE, COCOA (PROCESSED WITH ALKALI), EGG YOLKS, MILK, NONFAT MILK, GUAR GUM, NATURAL FLAVORS, LEMON JUICE CONCENTRATE, SALT, COCOA, SOY LECITHIN, VANILLA EXTRACT, CARRAGEENAN"
  },
  {
    "key": 8,
    "name": "Justice ReMix'd",
    "subhead": "Cinnamon & Chocolate Ice Creams with Gobs of Cinnamon Bun Dough & Spicy Fudge Brownies",
    "description": "Now serving Justice ReMix’d: the flavor and action campaign dedicated to criminal justice reform. We’re proud to work with Advancement Project National Office in supporting reforms that invest in people instead of prisons. Together we can transform the system to deliver justice for all, instead of just some. Join us at benjerry.com/justice.",
    "rating": 4.3,
    "rating_count": 110,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, WHEAT FLOUR, DRIED CANE SYRUP, COCOA (PROCESSED WITH ALKALI), EGG YOLKS, COCOA POWDER, SOYBEAN OIL, INVERT SUGAR, BUTTER (CREAM, SALT), COCONUT OIL, MOLASSES, SALT, EGGS, SPICES, BAKING SODA, CORN SYRUP, SOY LECITHIN, EGG WHITES, GUAR GUM, CINNAMON, NATURAL FLAVOR, CARRAGEENAN, VANILLA EXTRACT, MALTED BARLEY FLOUR"
  },
  {
    "key": 9,
    "name": "Boots on the Moooo’n",
    "subhead": "A Universe of Milk Chocolate Ice Cream with Fudge Cows & Toffee Meteor Clusters Orbiting a Sugar Cookie Dough Core",
    "description": "While Space Force works to get boots (back) on the moon, this cosmic concoction will launch your dreams into orbit. With fudgy astronaut cows & toffee meteors, space couldn't be any sweeter. Unless the moon was made out of sugar cookie dough. Which for this limited-time flavor, it actually is!\nView All Of Our Netflix Inspired Flavors",
    "rating": 4.7,
    "rating_count": 42,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, COCOA (PROCESSED WITH ALKALI), SOYBEAN OIL, COCONUT OIL, WHEAT FLOUR, CORN SYRUP, ALMONDS, BUTTER (CREAM, SALT), EGG YOLKS, VANILLA EXTRACT, SALT, NATURAL FLAVORS, EGGS, GUAR GUM, COCOA, SOY LECITHIN, MILK, BAKING SODA, CARRAGEENAN"
  },
  {
    "key": 10,
    "name": "Americone Dream",
    "subhead": "Vanilla Ice Cream with Fudge-Covered Waffle Cone Pieces & a Caramel Swirl",
    "description": "Founded in fudge-covered waffle cones, this caramel-swirled concoction is the only flavor that gets a s'cream of approval from The Late Show host, Stephen Colbert. What's sweeter is this flavor supports charitable causes through The Stephen Colbert AmeriCone Dream Fund.",
    "rating": 4.7,
    "rating_count": 370,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, CORN SYRUP, DRIED CANE SYRUP, SUGAR, WHEAT FLOUR, EGG YOLKS, COCONUT OIL, BUTTER (CREAM, SALT), COCOA, VANILLA EXTRACT, NATURAL FLAVOR, SOY LECITHIN, SALT, BUTTER OIL, MILK, CARRAGEENAN, GUAR GUM, SOYBEAN OIL, BAKING SODA"
  },
  {
    "key": 11,
    "name": "Bourbon Pecan Pie",
    "subhead": "Buttery Bourbon Ice Cream with Pecans, Shortbread Cookie Pieces & a Whiskey Caramel Swirl",
    "description": "Not long ago we scoop-toured through Texas asking you to elect the best of two Texas-inspired flavors. Thanks to you this bourbon-y whirl of pecans and cookies wrapped in whiskey-kissed caramel is now available Tex-clusively!",
    "rating": 4.6,
    "rating_count": 9,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, CORN SYRUP, PECANS, BUTTER (CREAM, SALT), WHEAT FLOUR, EGG YOLKS, SUGAR, DRIED CANE SYRUP, WHISKEY, DRY MALT EXTRACT (BARLEY), SOYBEAN OIL, SALT, EGGS, CARAMEL COLOR, PEANUT OIL, GUAR GUM, BAKING SODA, CARRAGEENAN, SOY LECITHIN. MAY CONTAIN OTHER TREE NUTS"
  },
  {
    "key": 12,
    "name": "Brewed to Matter",
    "subhead": "Coffee Ice Cream with Fudge Chunks & a Brownie Batter Swirl",
    "description": "We're thrilled to add this made-to-matter, brownie batter-swirled batchful of coffee awesomeness to the Ben & Jerry's family of flavors. It packs a powerful pintful of goodness that's guaranteed to amaze you with every consciously concocted bite.",
    "rating": 4.7,
    "rating_count": 35,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, COFFEE EXTRACT, COCONUT OIL, EGG YOLKS, COCOA PROCESSED WITH ALKALI, WHEAT FLOUR, BUTTER (CREAM, SALT), CHOCOLATE LIQUOR, CORN SYRUP, COCOA POWDER, CANOLA OIL, GUAR GUM, SOY LECITHIN, SALT, CARRAGEENAN, NATURAL FLAVOR, MILK FAT, BAKING SODA, VANILLA EXTRACT"
  },
  {
    "key": 13,
    "name": "Caramel Chocolate Cheesecake",
    "subhead": "Caramel Cheesecake Ice Cream with Cheesecake Pieces & Chocolate Cookie Swirls",
    "description": "In your cheesecake dreams, is it like you’re spooning through a world of caramel cheesecake ice cream swirled with chocolate cookies in a wonderland filled with chunks of cheesecake? Hello? You can wake up now…",
    "rating": 4,
    "rating_count": 133,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), SUGAR, CORN SYRUP, CANOLA OIL, CREAM CHEESE (PASTEURIZED MILK, CREAM, CHEESE CULTURES, SALT, CAROB BEAN GUM), COCONUT OIL, EGG YOLKS, WHEAT FLOUR, DRIED CANE SYRUP, SOYBEAN OIL, GRAHAM FLOUR, EGGS, COCOA (PROCESSED WITH ALKALI), NATURAL FLAVORS, COCOA, GUAR GUM, BUTTEROIL, MILK PROTEIN CONCENTRATE, CORN STARCH, SALT, SOY LECITHIN, TAPIOCA STARCH, PECTIN, CARAMELIZED SUGAR SYRUP, BAKING SODA, MOLASSES, HONEY, CARRAGEENAN, VANILLA EXTRACT"
  },
  {
    "key": 14,
    "name": "Cherry Garcia",
    "subhead": "Cherry Ice Cream with Cherries & Fudge Flakes",
    "description": "Our euphorically edible tribute to guitarist Jerry Garcia & Grateful Dead fans everywhere, it’s the first ice cream named for a rock legend and the most famous of our fan-suggested flavors.",
    "rating": 4.4,
    "rating_count": 153,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, CHERRIES, SUGAR, EGG YOLKS, COCONUT OIL, COCOA (PROCESSED WITH ALKALI), FRUIT AND VEGETABLE CONCENTRATES (COLOR), COCOA POWDER, GUAR GUM, NATURAL FLAVORS, LEMON JUICE CONCENTRATE, CARRAGEENAN, MILK FAT, SOY LECITHIN"
  },
  {
    "key": 15,
    "name": "Chillin' the Roast",
    "subhead": "Cold Brew Coffee Ice Cream with Chocolate Cookie-Covered Coffee Liqueur Truffles & Fudge Swirls",
    "description": "Our cold brew coffee ice cream not only delivers a chillacious blast of creamy caffeination, it’s also loaded with enough coffee liqueur-filled, cookie crumble-covered truffles to fuel a truffolution.",
    "rating": 3.3,
    "rating_count": 172,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, COCONUT OIL, EGG YOLKS, BUTTER (CREAM, SALT), COFFEE, WHEAT FLOUR, MILK PROTEIN CONCENTRATE, COCOA (PROCESSED WITH ALKALI), SOYBEAN OIL, GUAR GUM, NATURAL FLAVOR, SALT, CORN STARCH, CANOLA OIL, RUM, SOY LECITHIN, CHOCOLATE, BAKING SODA, CARRAGEENAN"
  },
  {
    "key": 16,
    "name": "Chocolate Chip Cookie Dough",
    "subhead": "Vanilla Ice Cream with Gobs of Chocolate Chip Cookie Dough",
    "description": "We knew we were onto something big when we made the world’s first batch of Chocolate Chip Cookie Dough ice cream in 1984. Today the flavor still reigns among our all-time most popular concoctions.",
    "rating": 4.6,
    "rating_count": 983,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, WHEAT FLOUR, SUGAR, BROWN SUGAR, EGG YOLKS, BUTTER (CREAM, SALT), EXPELLER PRESSED SOYBEAN OIL, EGGS, COCONUT OIL, CHOCOLATE LIQUOR, VANILLA EXTRACT, COCOA (PROCESSED WITH ALKALI), COCOA POWDER, SALT, MOLASSES, GUAR GUM, COCOA BUTTER, NATURAL FLAVOR, CARRAGEENAN, MILK FAT, SOY LECITHIN"
  },
  {
    "key": 17,
    "name": "Chocolate Fudge Brownie",
    "subhead": "Chocolate Ice Cream with Fudge Brownies",
    "description": "The fabulously fudgy brownies in this flavor come from New York’s Greyston Bakery, where producing great baked goods is part of their greater-good mission to provide jobs and training to low-income city residents.",
    "rating": 3.4,
    "rating_count": 204,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, COCOA (PROCESSED WITH ALKALI), WHEAT FLOUR, COCOA POWDER, SOYBEAN OIL, EGG YOLKS, INVERT CANE SUGAR, EGGS, EGG WHITES, GUAR GUM, SALT, CARRAGEENAN, VANILLA EXTRACT, MALTED BARLEY FLOUR, SODIUM BICARBONATE"
  },
  {
    "key": 18,
    "name": "Chocolate Shake It",
    "subhead": "Chocolate Malt Milkshake Ice Cream With Salted Fudge Pieces & Marshmallow Swirls",
    "description": "For those who prefer their ice cream shaken & swirled here’s a chocolate malt milkshake and marshmallow creation we topped off with euphoric morsels of salted fudge. Enjoy!",
    "rating": 3.9,
    "rating_count": 111,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, CORN SYRUP, WHEAT FLOUR, POWDERED SUGAR (CANE SUGAR, CORNSTARCH), SUGAR, EGG YOLKS, COCOA (PROCESSED WITH ALKALI), BUTTER (CREAM, SALT), BARLEY MALT, TAPIOCA SYRUP, EGG WHITES, MILK, COCOA, SEA SALT, GUAR GUM, NATURAL FLAVOR, PECTIN, VANILLA EXTRACT, ENZYMES, CARRAGEENAN, SALT, BAKING SODA"
  },
  {
    "key": 19,
    "name": "Chocolate Therapy",
    "subhead": "Chocolate Ice Cream with Chocolate Cookies & Swirls of Chocolate Pudding Ice Cream",
    "description": "You know how sometimes you just want to scream? You could just scream, or you could grab a spoon, get a grip, and treat yourself to some primal s'cream therapy of the sublimest chocolate kind. (Euphoria may occur upon tasting.)",
    "rating": 4.8,
    "rating_count": 72,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, COCOA (PROCESSED WITH ALKALI), WHEAT FLOUR, SUGAR, SOYBEAN OIL, BROWN SUGAR, EGG YOLKS, CHOCOLATE LIQUOR, COCOA, HONEY, GUAR GUM, COCOA BUTTER, VANILLA EXTRACT, SALT, BAKING SODA, NATURAL FLAVORS, SOY LECITHIN, CARRAGEENAN"
  },
  {
    "key": 20,
    "name": "Chubby Hubby",
    "subhead": "Vanilla Malt Ice Cream with Peanutty Fudge-Covered Pretzels with Fudge & Peanut Buttery Swirls",
    "description": "Two tricksters convinced a co-worker this flavor really existed (it didn’t), then felt guilty & made him an actual batch packed with pretzels, peanut butter & fudge. He loved it, so did we, & the rest is history. Enjoy!",
    "rating": 4.3,
    "rating_count": 118,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, PEANUTS, WHEAT FLOUR, COCONUT OIL, PARTIALLY DEFATTED PEANUT FLOUR, EGG YOLKS, BUTTER (CREAM, SALT), PEANUT OIL, BARLEY MALT, VANILLA EXTRACT, MILK, COCOA (PROCESSED WITH ALKALI), SALT, SOY LECITHIN, COCOA, CHOCOLATE LIQUOR, SOYBEAN OIL, GUAR GUM, ENZYMES, BAKING SODA, CARRAGEENAN"
  },
  {
    "key": 21,
    "name": "Chunky Monkey",
    "subhead": "Banana Ice Cream with Fudge Chunks & Walnuts",
    "description": "To create a flavor as fun as the name, we monkeyed around with bunches of test batches until we knew we had a winner: the nuttiest chocolatey-chunkiest concoction-gone-bananas you'll ever go ape for.",
    "rating": 4.4,
    "rating_count": 108,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, WALNUTS, BANANA PUREE, COCONUT OIL, EGG YOLKS, COCOA (PROCESSED WITH ALKALI), COCOA POWDER, LEMON JUICE CONCENTRATE, GUAR GUM, NATURAL FLAVORS, MILK FAT, CARRAGEENAN, SOY LECITHIN, VANILLA EXTRACT"
  },
  {
    "key": 22,
    "name": "Cinnamon Buns",
    "subhead": "Caramel Ice Cream with Cinnamon Bun Dough & a Cinnamon Streusel Swirl",
    "description": "Our cool salute to cinnamon buns is so cinnamon-streuseled & dough-loaded, there's no telling where the cinnamon buns end or the ice cream begins. That's because it's one fun flavor all the way through. Enjoy!",
    "rating": 4.6,
    "rating_count": 83,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), SUGAR, DRIED CANE SYRUP, WHEAT FLOUR, CORN SYRUP, EGG YOLKS, BROWN SUGAR, SOYBEAN OIL, BUTTER (CREAM, SALT), SPICE, COCONUT OIL, MOLASSES, SALT, SOY LECITHIN, SODIUM BICARBONATE, VANILLA EXTRACT, GUAR GUM, CARRAGEENAN"
  },
  {
    "key": 23,
    "name": "Coffee Coffee BuzzBuzzBuzz!",
    "subhead": "Coffee Ice Cream with Espresso Bean Fudge Chunks",
    "description": "Somewhere between the creamy coffee coffee ice cream & the buzzbuzzbuzz of espresso fudge, it hits you: you’re wide awake & in lovelovelove.",
    "rating": 4.9,
    "rating_count": 47,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, COCONUT OIL, COFFEE EXTRACT, EGG YOLKS, COCOA (PROCESSED WITH ALKALI), COFFEE, COCOA POWDER, SOY LECITHIN, GUAR GUM, VANILLA EXTRACT, CARRAGEENAN"
  },
  {
    "key": 24,
    "name": "Coffee Toffee Bar Crunch",
    "subhead": "Coffee Ice Cream with Fudge-Covered Toffee Pieces",
    "description": "Coffee What Bar Crunch?  We gave this flavor a new name to go with the new toffee bars we’re using as part of our commitment to source Fairtrade Certified and non-GMO ingredients.  We love it and know you will too!",
    "rating": 2.9,
    "rating_count": 302,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, COCONUT OIL, COFFEE EXTRACT, EGG YOLKS, BUTTER (CREAM, SALT), ALMONDS, COCOA (PROCESSED WITH ALKALI), MILK, SOY LECITHIN, COCOA, NATURAL FLAVOR, SALT, VANILLA EXTRACT, VEGETABLE OIL (CANOLA, SAFFLOWER, AND/OR SUNFLOWER OIL), GUAR GUM, CARRAGEENAN"
  },
  {
    "key": 25,
    "name": "Cold Brew Caramel Latte",
    "subhead": "Cold Brew & Sweet Cream Ice Creams with Salted Caramel Swirls",
    "description": "If you’ve been looking for a more chillacious way to get your Ben & Jerry’s on, this dreamy latte-inspired ice cream made with cold brew coffee, rich sweet cream, & salt-kissed caramel is a mighty cool & euphoric motorvator.",
    "rating": 4.6,
    "rating_count": 10,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), CORN SYRUP, EGG YOLKS, SUGAR, BUTTER (CREAM, SALT), COFFEE, SEA SALT, GUAR GUM, CARAMELIZED SUGAR SYRUP, CARRAGEENAN, BAKING SODA"
  },
  {
    "key": 26,
    "name": "Everything But The...",
    "subhead": "A Collision of Chocolate & Vanilla Ice Creams mixed with Peanut Butter Cups, Fudge-Covered Toffee Pieces, White Chocolatey Chunks & Fudge-Covered Almonds",
    "description": "We've combined some of your most favorite Ben & Jerry's flavors & swirled them into even bigger show-stoppers. Now you can enjoy them in tasty, twisted tandem!",
    "rating": 3.8,
    "rating_count": 72,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, COCONUT OIL, COCOA (PROCESSED WITH ALKALI), EGG YOLKS, PEANUTS, ROASTED ALMONDS (ALMONDS, PEANUT OIL), PARTIALLY DEFATTED PEANUT FLOUR, DRIED CANE SYRUP, BUTTER (CREAM, SALT), VANILLA EXTRACT, MILK, COCOA, SOY LECITHIN, ALMONDS, SALT, GUAR GUM, NATURAL FLAVORS, MILK FAT, BUTTEROIL, VEGETABLE OIL (CANOLA, SAFFLOWER, AND/OR SUNFLOWER OIL), CARRAGEENAN, CORN MALTODEXTRIN"
  },
  {
    "key": 27,
    "name": "Glampfire Trail Mix",
    "subhead": "Chocolate Ice Cream with Crunchy Pretzel Swirls, Marshmallow Swirls & Fudge-Covered Almonds",
    "description": "Inspired by glampfire tales of outdoorsy getaways filled with indoorsy perks, our trail mix is uber-chocolatey, nutty, marshmallowed-&-pretzeled, so you can get lost in the dessert without leaving the yurt.",
    "rating": 4.7,
    "rating_count": 68,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, COCOA (PROCESSED WITH ALKALI), CORN SYRUP, SUGAR, CANOLA OIL, WHEAT FLOUR, CORN STARCH, ROASTED ALMONDS (ALMONDS, PEANUT OIL), DRIED CANE SYRUP, COCONUT OIL, EGG YOLKS, SALT, MILK FAT, COCOA, EGG WHITES, SOY LECITHIN, BUTTEROIL, VANILLA EXTRACT, GUAR GUM, TAPIOCA STARCH, NATURAL FLAVOR, PECTIN, SOYBEAN OIL, BAKING SODA, CARRAGEENAN, BARLEY MALT"
  },
  {
    "key": 28,
    "name": "Half Baked",
    "subhead": "Chocolate & Vanilla Ice Creams mixed with Gobs of Chocolate Chip Cookie Dough & Fudge Brownies",
    "description": "Ben & Jerry’s is proud to partner with fellow B Corps Greyston & Rhino Bakeries to bring you half baked. The incredible stories behind both the fudge brownies & cookie dough make this a flavor that not only tastes good, but does good.",
    "rating": 4.7,
    "rating_count": 887,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, WHEAT FLOUR, BROWN SUGAR, COCOA (PROCESSED WITH ALKALI), EGG YOLKS, BUTTER (CREAM, SALT), COCOA POWDER, EGGS, EXPELLER PRESSED SOYBEAN OIL, SOYBEAN OIL, INVERT CANE SUGAR, CHOCOLATE LIQUOR, VANILLA EXTRACT, SALT, EGG WHITES, GUAR GUM, MOLASSES, COCOA BUTTER, NATURAL FLAVOR, CARRAGEENAN, SOY LECITHIN, BAKING SODA, MALTED BARLEY FLOUR"
  },
  {
    "key": 29,
    "name": "Ice Cream Sammie",
    "subhead": "Vanilla Ice Cream with Chocolate Sandwich Cookies & Chocolate Cookie Swirls",
    "description": "To capture the great taste of the classic ice cream sandwich in a flavor that’s not actually a sandwich, we packed our creamy-rich vanilla ice cream with chocolate sandwich cookies & swirls, best-captured, by you, with a spoon.",
    "rating": 5,
    "rating_count": 31,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, WHEAT FLOUR, CANOLA OIL, EGG YOLKS, COCOA PROCESSED WITH ALKALI, COCONUT OIL, SUNFLOWER OIL, COCOA, BUTTEROIL, SALT, BAKING SODA, TAPIOCA STARCH, NATURAL FLAVORS, GUAR GUM, SOY LECITHIN, VANILLA EXTRACT, NATURAL FLAVOR, CARRAGEENAN"
  },
  {
    "key": 30,
    "name": "Milk & Cookies",
    "subhead": "Vanilla Ice Cream with a Chocolate Cookie Swirl, Chocolate Chip & Chocolate Chocolate Chip Cookies",
    "description": "How do you take classic milk-&-cookie goodness to a whole 'nother level of greatness? We don’t really know what that means, but we know this flavor’s loaded with the most euphoric assortment of cookies we ever dunked, chunked & swirled in our ice cream.",
    "rating": 4.7,
    "rating_count": 104,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, WHEAT FLOUR, CANOLA OIL, EGG YOLKS, BROWN SUGAR, BUTTER (CREAM, SALT), COCOA (PROCESSED WITH ALKALI), COCOA, COCONUT OIL, CHOCOLATE LIQUOR, SOYBEAN OIL, EGGS, SALT, NATURAL FLAVORS, VANILLA EXTRACT, TAPIOCA STARCH, GUAR GUM, HONEY, BAKING SODA, COCOA BUTTER, SOY LECITHIN, VANILLA BEANS, CARRAGEENAN"
  },
  {
    "key": 31,
    "name": "Mint Chocolate Cookie",
    "subhead": "Peppermint Ice Cream with Chocolate Sandwich Cookies",
    "description": "In case you’ve ever wondered what makes this wintry flavor so wicked cool to luge a spoon through: it’s the pepperminty excellence we packed in it, not to mention all those chocolate sandwich cookie moguls. Enjoy!",
    "rating": 4.4,
    "rating_count": 141,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, WHEAT FLOUR, EGG YOLKS, COCONUT OIL, COCOA (PROCESSED WITH ALKALI), SUNFLOWER OIL, SALT, BAKING SODA, GUAR GUM, NATURAL FLAVORS, SOY LECITHIN, PEPPERMINT EXTRACT, CARRAGEENAN"
  },
  {
    "key": 32,
    "name": "Minter Wonderland",
    "subhead": "Dark Chocolate Mint Ice Cream with Marshmallow Swirls & Chocolate Cookie Swirls",
    "description": "Imagine a wild ride through the wintriest, chocolate mintiest wonderland of ice cream filled with crunchy cookie swirls and marshmallowy drifts. Honestly, if this flavor was a toboggan, you’d already be on it.",
    "rating": 4.7,
    "rating_count": 32,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, COCOA (PROCESSED WITH ALKALI), SUGAR, CORN SYRUP, CANOLA OIL, WHEAT FLOUR, EGG YOLKS, COCOA, COCONUT OIL, EGG WHITES, NATURAL FLAVORS, TAPIOCA STARCH, GUAR GUM, SALT, PECTIN, SOY LECITHIN, BAKING SODA, CARRAGEENAN"
  },
  {
    "key": 33,
    "name": "New York Super Fudge Chunk",
    "subhead": "Chocolate Ice Cream with White & Dark Fudge Chunks, Pecans, Walnuts & Fudge-Covered Almonds",
    "description": "In 1985, to make a name for ourselves in New York, we picked a New York kind of name and created a flavor packed with more kinds of chunks than ever before. We figured if the flavor was euphoric in New York, it would be everywhere. It was, and it is.",
    "rating": 4.9,
    "rating_count": 63,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, COCOA (PROCESSED WITH ALKALI), SUGAR, COCONUT OIL, WALNUTS, PECANS, ROASTED ALMONDS (ALMONDS, PEANUT OIL), DRIED CANE SYRUP, EGG YOLKS, COCOA, MILK FAT, SALT, SOY LECITHIN, VANILLA EXTRACT, GUAR GUM, BUTTEROIL, PEANUT OIL, BUTTER (CREAM), NATURAL FLAVORS, CARRAGEENAN"
  },
  {
    "key": 34,
    "name": "Oat of This Swirled",
    "subhead": "Buttery Brown Sugar Ice Cream with Fudge Flakes & Oatmeal Cinnamon Cookie Swirls",
    "description": "When’s the best time to enjoy this blissful mix of brown sugar ice cream with otherworldly swirls of cinnamony oatmeal cookies? Any time between breakfast and bed, from now ‘til whenever.",
    "rating": 4.5,
    "rating_count": 255,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, CANOLA OIL, COCONUT OIL, EGG YOLKS, BUTTER (CREAM, SALT), COCOA (PROCESSED WITH ALKALI), BUTTER OIL, WHEAT FLOUR, OATS, BROWN SUGAR, COCOA POWDER, SPICE, TAPIOCA STARCH, SALT, GUAR GUM, SOY LECITHIN, VANILLA EXTRACT, BAKING SODA, NATURAL FLAVOR, LEMON JUICE CONCENTRATE, CARRAGEENAN, MILK FAT"
  },
  {
    "key": 35,
    "name": "Peanut Butter Cup",
    "subhead": "Peanut Butter Ice Cream with Peanut Butter Cups",
    "description": "We interrupt our regularly scheduled programming to remind you how much you love ice cream that’s perfectly peanut buttery & peanut butter cuppity at the same time.",
    "rating": 4.4,
    "rating_count": 41,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, PEANUTS, SUGAR, COCONUT OIL, EGG YOLKS, PARTIALLY DEFATTED PEANUT FLOUR, PEANUT OIL, MILK, COCOA (PROCESSED WITH ALKALI), SALT, GUAR GUM, COCOA, NATURAL FLAVOR, SOY LECITHIN, VANILLA EXTRACT, CARRAGEENAN"
  },
  {
    "key": 36,
    "name": "Peanut Butter World",
    "subhead": "Milk Chocolate Ice Cream with Peanut Buttery Swirls & Chocolate Cookie Swirls",
    "description": "What makes Ben & Jerry's so euphoric? Some say it's the legendary creamy-richness of our flavor creations. Others say it's the tastebud-boggling combinations of spoon-bending chunks & perfect swirls. We say, \"Enjoy!",
    "rating": 4.9,
    "rating_count": 69,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, PEANUTS, SUGAR, COCOA (PROCESSED WITH ALKALI), CANOLA OIL, PEANUT OIL, WHEAT FLOUR, COCOA, COCONUT OIL, EGG YOLKS, SALT, TAPIOCA STARCH, GUAR GUM, NATURAL FLAVORS, SOY LECITHIN, BAKING SODA, CARRAGEENAN"
  },
  {
    "key": 37,
    "name": "Phish Food",
    "subhead": "Chocolate Ice Cream with Gooey Marshmallow Swirls, Caramel Swirls & Fudge Fish",
    "description": "“Ben was our neighbor through the woods & we're fond of ice cream. So we teamed up to create Phish Food. A portion of our royalties from this flavor goes toward environmental efforts in Vermont's Lake Champlain Watershed. Enjoy!” - PHISH",
    "rating": 4.8,
    "rating_count": 93,
    "ingredients": "CREAM, WATER, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), CORN SYRUP, SUGAR, COCOA PROCESSED WITH ALKALI, COCONUT OIL, BUTTER (CREAM, SALT), EGG YOLKS, EGG WHITES, VANILLA EXTRACT, NATURAL FLAVOR, GUAR GUM, PECTIN, COCOA, SALT, CARRAGEENAN, BAKING SODA, MILK, SOY LECITHIN"
  },
  {
    "key": 38,
    "name": "Pistachio Pistachio",
    "subhead": "Pistachio Ice Cream with Lightly Roasted Pistachios",
    "description": "The name alone shows how much we love pistachios. But don't just take our word for it - let the flavor speak for itself!",
    "rating": 4,
    "rating_count": 80,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, PISTACHIOS, EGG YOLKS, SUGAR, COCONUT OIL, GUAR GUM, SALT, NATURAL FLAVORS, CARRAGEENAN"
  },
  {
    "key": 39,
    "name": "Pumpkin Cheesecake",
    "subhead": "Pumpkin Cheesecake Ice Cream with a Graham Cracker Swirl",
    "description": "We took the great taste of pumpkin cheesecake & gave it an ice cream upgrade, complete with a complementary graham cracker swirl, so it's more than just a great flavor: it's a first-class ticket to pumpkin wonderful.",
    "rating": 4.6,
    "rating_count": 58,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), SUGAR, PUMPKIN PUREE, SOYBEAN OIL, EGG YOLKS, CORN STARCH, CREAM CHEESE (CULTURED PASTEURIZED MILK AND CREAM, SALT, ENZYMES), WHEAT FLOUR, GRAHAM FLOUR, SALT, BUTTEROIL, CANOLA OIL, TAPIOCA STARCH, GUAR GUM, CINNAMON, LACTIC ACID, MOLASSES, HONEY, SOY LECITHIN, BAKING SODA, NATURAL FLAVOR, NUTMEG, GINGER, LEMON JUICE CONCENTRATE, CLOVES, ANNATTO (COLOR), CARRAGEENAN"
  },
  {
    "key": 40,
    "name": "Red, White & Blueberry",
    "subhead": "Blueberry & Raspberry Ice Cream swirled with Vanilla Ice Cream with Strawberries & Shortbread Pieces",
    "description": "Hooray for Red, White & Blueberry! From the strawberried fields of raspberry, blueberry, & vanilla ice creams to the glorious morsels of shortbread, every spoonful’s a salute to taste beyond the fruited plain.",
    "rating": 3.4,
    "rating_count": 39,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), BLUEBERRY PUREE CONCENTRATE, STRAWBERRIES, EGG YOLKS, WHEAT FLOUR, DRIED CANE SYRUP, SUGAR, BUTTER (CREAM, SALT), RASPBERRY PUREE, SOYBEAN OIL, VANILLA EXTRACT, EGGS, GUAR GUM, BAKING SODA, SALT, CARRAGEENAN, LEMON JUICE CONCENTRATE"
  },
  {
    "key": 41,
    "name": "S'mores",
    "subhead": "Chocolate Ice Cream with Fudge Chunks, Toasted Marshmallow & Graham Cracker Swirls",
    "description": "Remember when cookouts & campfires kindled your cravings for s'mores, glorious s’mores? We loaded this flavor with all the stuff that makes s’mores so glorious, so you can kindle your cravings whenever, no campfires required.",
    "rating": 4.1,
    "rating_count": 151,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, COCOA (PROCESSED WITH ALKALI), SOYBEAN OIL, CORN SYRUP, CORN STARCH, COCONUT OIL, CORN SYRUP SOLIDS, WHEAT FLOUR, GRAHAM FLOUR, EGG YOLKS, SALT, BUTTEROIL, EGG WHITES, CANOLA OIL, COCOA POWDER, GUAR GUM, TAPIOCA STARCH, MOLASSES, HONEY, SOY LECITHIN, SODIUM BICARBONATE, VANILLA EXTRACT, PECTIN, MILKFAT, CARRAGEENAN, NATURAL FLAVOR"
  },
  {
    "key": 42,
    "name": "Salted Caramel Almond",
    "subhead": "Vanilla Bean Ice Cream with Roasted Almond Slivers, Fudge Flakes & a Salted Caramel Swirl",
    "description": "What makes Ben & Jerry’s so euphoric? Some say it’s the legendary creamy-richness of our flavor creations. Others say it’s the tastebud-boggling combinations of spoon-bending chunks & perfect swirls. We say, “Enjoy!",
    "rating": 4.5,
    "rating_count": 23,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, ALMONDS, MILK, EGG YOLKS, COCONUT OIL, CORN SYRUP, COCOA (PROCESSED WITH ALKALI), BUTTER (CREAM, SALT), BUTTEROIL, PECTIN, SEA SALT, COCOA POWDER, GUAR GUM, VANILLA EXTRACT, SOY LECITHIN, BAKING SODA, VANILLA BEANS, MILK FAT, CARRAGEENAN, LACTASE, NATURAL FLAVOR"
  },
  {
    "key": 43,
    "name": "Strawberry Cheesecake",
    "subhead": "Strawberry Cheesecake Ice Cream with Strawberries & a Thick Graham Cracker Swirl",
    "description": "For strawberry cheesecake lovers who’ve always wanted to have their cheesecake & scoop it, too, we’ve created a flavor jam-packed with strawberry cheesecake-greatness & a fantastic graham-cracker swirl.",
    "rating": 4.7,
    "rating_count": 231,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), SUGAR, STRAWBERRIES, SOYBEAN OIL, STRAWBERRY PUREE, EGG YOLKS, CORN STARCH, CREAM CHEESE (CULTURED PASTEURIZED MILK AND CREAM, SALT, ENZYMES), WHEAT FLOUR, GRAHAM FLOUR, SALT, BUTTEROIL, CANOLA OIL, GUAR GUM, NATURAL FLAVORS, TAPIOCA STARCH, MOLASSES, HONEY, LACTIC ACID, SOY LECITHIN, SODIUM BICARBONATE, LEMON JUICE CONCENTRATE, PECTIN, CARRAGEENAN"
  },
  {
    "key": 44,
    "name": "The Tonight Dough",
    "subhead": "Caramel & Chocolate Ice Creams with Chocolate Cookie Swirls & Gobs of Chocolate Chip Cookie Dough & Peanut Butter Cookie Dough.",
    "description": "Inspired by the show & host we love staying up late for, here's a flavor you'll love spooning into - dedicated to SeriousFun Children's Network of global camps for children with serious illnesses. Learn more at seriousfunnetwork.org.",
    "rating": 4.7,
    "rating_count": 639,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, WHEAT FLOUR, SUGAR, COCOA (PROCESSED WITH ALKALI), BROWN SUGAR, CANOLA OIL, EGG YOLKS, PEANUT BUTTER (PEANUTS), CORN SYRUP, EGGS, COCOA, BUTTER (CREAM, SALT), COCONUT OIL, SOYBEAN OIL, SALT, CHOCOLATE LIQUOR, NATURAL FLAVORS, TAPIOCA STARCH, GUAR GUM, BAKING SODA, SOY LECITHIN, MOLASSES, COCOA BUTTER, CARRAGEENAN"
  },
  {
    "key": 45,
    "name": "Triple Caramel Chunk",
    "subhead": "Caramel Ice Cream with a Swirl of Caramel & Fudge-Covered Caramel Chunks",
    "description": "Caramel lovers won’t want to miss a single moment of this must-eat caramel thrillogy, starring creamy caramel ice cream, gooey caramel swirls, and chewy caramel chunks. They probably won’t want it to end, either. Enjoy!",
    "rating": 4.3,
    "rating_count": 16,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), CORN SYRUP, SUGAR, EGG YOLKS, COCONUT OIL, BUTTER (CREAM, SALT), MILK, COCOA (PROCESSED WITH ALKALI), SALT, GUAR GUM, CARRAGEENAN, VANILLA EXTRACT, BAKING SODA, COCOA, SOY LECITHIN, NATURAL FLAVOR"
  },
  {
    "key": 46,
    "name": "Urban Bourbon",
    "subhead": "Burnt Caramel Ice Cream with Almonds, Fudge Flakes & Bourbon Caramel Swirls",
    "description": "Want to enjoy a night on the town without leaving the house? Treat yourself to a caramel concoction that’s bold, toasty and bourbon-swirled, with lots of nuts and fudge for fun.",
    "rating": 4.2,
    "rating_count": 181,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), CORN SYRUP, SUGAR, ALMONDS, COCONUT OIL, EGG YOLKS, COCOA (PROCESSED WITH ALKALI), BUTTER (CREAM, SALT), WHISKEY, CARAMELIZED SUGAR SYRUP, COCOA POWDER, DRY MALT EXTRACT (BARLEY), GUAR GUM, SALT, CARRAGEENAN, BAKING SODA, MILK FAT, SOY LECITHIN, VANILLA EXTRACT, NATURAL FLAVOR"
  },
  {
    "key": 47,
    "name": "Vanilla",
    "subhead": "Vanilla Ice Cream",
    "description": "When you dig into this pint, you’ll find a rich, creamy Vanilla that’s more vanilla-tasting than any Vanilla you’ve ever tasted.",
    "rating": 4.7,
    "rating_count": 10,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, EGG YOLKS, SUGAR, GUAR GUM, VANILLA EXTRACT, VANILLA BEANS, CARRAGEENAN"
  },
  {
    "key": 48,
    "name": "Vanilla Caramel Fudge",
    "subhead": "Vanilla Ice Cream with Swirls of Caramel & Fudge",
    "description": "If you’ve been looking for reasons to try something chunkless, this container holds a Vanilla-rich, fudge-luscious & caramel-gooey pintful of them. Enjoy!",
    "rating": 4.8,
    "rating_count": 29,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, CORN SYRUP, SUGAR, BUTTER (CREAM, SALT), EGG YOLKS, VANILLA EXTRACT, COCOA (PROCESSED WITH ALKALI), SALT, CARRAGEENAN, CHOCOLATE LIQUOR, GUAR GUM, BAKING SODA"
  },
  {
    "key": 49,
    "name": "Boom Chocolatta Cookie Core",
    "subhead": "Mocha & Caramel Ice Creams with Chocolate Cookies, Fudge Flakes & a Chocolate Cookie Core",
    "description": "As you slam dunk your spoon through creamy mocha & caramel to celebrate the epic chocolate cookie-spread core, your technique may not be perfect, but the victory’s perfectly delicious.",
    "rating": 4.6,
    "rating_count": 97,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, SOYBEAN OIL, COCOA (PROCESSED WITH ALKALI), EGG YOLKS, BUTTER (CREAM, SALT), COFFEE EXTRACT, CORN SYRUP, RICE FLOUR, POTATO FLOUR, WHEAT FLOUR, COCONUT OIL, BROWN SUGAR, VANILLA EXTRACT, BAKING SODA, SALT, NATURAL FLAVOR, COCOA POWDER, SOY LECITHIN, EGGS, CHOCOLATE LIQUOR, COCOA BUTTER, MILK, WHEY PROTEIN CONCENTRATE, GUAR GUM, CARRAGEENAN, MILKFAT"
  },
  {
    "key": 50,
    "name": "Chocolate Chip Cookie Dough Core",
    "subhead": "Cookie Milk Ice Cream with Fudge Chips & a Chocolate Chip Cookie Dough Core",
    "description": "Our latest cookie dough creation is boldly loaded like never before, with ice cream that tastes like a just-dunked-cookie, & an epic core of chocolate-chippity dough where no dough has ever been.",
    "rating": 1.8,
    "rating_count": 166,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), SUGAR, SOYBEAN OIL, EGG YOLKS, WHEAT FLOUR, COCONUT OIL, CHOCOLATE CHIPS (SUGAR, UNSWEETENED CHOCOLATE, COCOA BUTTER, SOY LECITHIN, NATURAL FLAVOR), BUTTER (CREAM, SALT), COCOA (PROCESSED WITH ALKALI), CORN SYRUP, NATURAL FLAVOR, COCOA POWDER, EGGS, MOLASSES, SALT, GUAR GUM, BROWN SUGAR, CHOCOLATE LIQUOR, VANILLA EXTRACT, SOY LECITHIN, CARRAGEENAN, BAKING SODA, COCOA BUTTER"
  },
  {
    "key": 51,
    "name": "Sweet Like Sugar Cookie Dough Core",
    "subhead": "Sweet Cream Ice Cream with a hint of Almond flavor & Shortbread Cookies & Cherry Ice Cream with Cherries & a Sugar Cookie Dough Core",
    "description": "Instead of just giving you some sugar cookie dough, we thought you’d enjoy a core full even more, enwrapped in almond-kissed sweet cream & cherry ice creams packed with cookies & cherries. Do we love you or what?",
    "rating": 4.8,
    "rating_count": 123,
    "ingredients": "CREAM, SKIM MILK, WATER, LIQUID SUGAR (SUGAR, WATER), SUGAR, CHERRIES, SOYBEAN OIL, WHEAT FLOUR, EGG YOLKS, BUTTER (CREAM, SALT), DRIED CANE SYRUP, EGGS, NATURAL FLAVOR, COCONUT OIL, SALT, GUAR GUM, FRUIT AND VEGETABLE CONCENTRATES (COLOR), LEMON JUICE CONCENTRATE, CARRAGEENAN, BAKING SODA, ALMOND EXTRACT"
  },
  {
    "key": 52,
    "name": "Wake & \" No Bake \" Cookie Dough Core",
    "subhead": "Vanilla Ice Cream with Peanut Butter Cookies, Peanut Butter Ice Cream with Fudge Chips & a No Bake Cookie Dough Core",
    "description": "Now that we’ve core-fully captured the No Bake cookie dough of your dreams in the middle of our fudge-&-cookie-chunked peanut butter and vanilla ice creams, we bet you’ll love how it tastes when you’re awake.",
    "rating": 3.3,
    "rating_count": 68,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, SOYBEAN OIL, PEANUTS, EGG YOLKS, OATS, WHEAT FLOUR, BUTTER (CREAM, SALT), COCONUT OIL, PEANUT OIL, COCOA (PROCESSED WITH ALKALI), NATURAL FLAVOR, SALT, BROWN SUGAR, EGGS, VANILLA EXTRACT, COCOA POWDER, GUAR GUM, BAKING SODA, CARRAGEENAN, MILK FAT, SOY LECITHIN"
  },
  {
    "key": 53,
    "name": "Brownie Batter Core",
    "subhead": "Chocolate & Vanilla Ice Creams with Fudge Brownies & a Brownie Batter Core",
    "description": "Spooning your way to brownie nirvana? Smack dab in the middle of this brownie-chunk-filled ice cream there's a core of unbaked brownie batter calling your name. No, really. We heard it.",
    "rating": 3.5,
    "rating_count": 108,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, COCOA PROCESSED WITH ALKALI, EGG YOLKS, WHEAT FLOUR, BUTTER (CREAM, SALT), CHOCOLATE LIQUOR, COCONUT OIL, CORN SYRUP, COCOA POWDER, SOYBEAN OIL, INVERT SUGAR, EGGS, CANOLA OIL, SALT, GUAR GUM, EGG WHITES, CARRAGEENAN, NATURAL FLAVOR, SOY LECITHIN, BAKING SODA, VANILLA EXTRACT, MALTED BARLEY FLOUR"
  },
  {
    "key": 54,
    "name": "Cookies & Cream Cheesecake Core",
    "subhead": "Chocolate & Cheesecake Ice Creams with Chocolate Cookies & a Cheesecake Core",
    "description": "What's it called when you find yourself spoon-deep in a rich center of cheesecake in the middle of a cool ice cream universe of chocolate, cheesecake & cookies? A Core encounter of the Ben & Jerriest kind.",
    "rating": 4.4,
    "rating_count": 57,
    "ingredients": "CREAM, LIQUID SUGAR (SUGAR, WATER), SKIM MILK, WATER, SUGAR, HEAVY CREAM, COCOA (PROCESSED WITH ALKALI), WHEAT FLOUR, EGG YOLKS, BUTTER (CREAM, SALT), CREAM CHEESE (PASTEURIZED MILK AND CREAM, CHEESE CULTURE, SALT, CAROB BEAN GUM, GUAR GUM), MILK PROTEIN CONCENTRATE, COCONUT OIL, BROWN SUGAR, EGGS, NATURAL FLAVOR, SALT, GUAR GUM, CAROB BEAN GUM, MODIFIED FOOD STARCH (CORN), SOY LECITHIN, XANTHAN GUM, BAKING SODA, VANILLA EXTRACT, CARRAGEENAN"
  },
  {
    "key": 55,
    "name": "Karamel Sutra Core",
    "subhead": "Chocolate & Caramel Ice Creams with Fudge Chips & a Soft Caramel Core",
    "description": "Find your way to the ultimate ice cream experience with our Cores. Whether your primal urges lead you to the center of soft caramel or directly to the fudge chips, you’ll be in total control of your own ice cream destiny.",
    "rating": 4.2,
    "rating_count": 94,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, SUGAR, MILK, CORN SYRUP, COCOA (PROCESSED WITH ALKALI), EGG YOLKS, COCONUT OIL, BUTTER (CREAM, SALT), COCOA POWDER, MILK FAT, PECTIN, GUAR GUM, BAKING SODA, LACTASE, SOY LECITHIN, VANILLA EXTRACT, SALT, CARRAGEENAN, MILKFAT, NATURAL FLAVOR"
  },
  {
    "key": 56,
    "name": "Peanut Butter Fudge Core",
    "subhead": "Chocolate & Peanut Butter Ice Creams with Mini Peanut Butter Cups & a Peanut Butter Fudge Core",
    "description": "Find your way to the ultimate ice cream experience with our Cores. Whether your primal urges lead you to the center of peanut butter fudge or directly to the peanut butter cups, you’ll be in total control of your own ice cream destiny.",
    "rating": 4.7,
    "rating_count": 19,
    "ingredients": "CREAM, SKIM MILK, LIQUID SUGAR (SUGAR, WATER), WATER, PEANUTS, SUGAR, COCONUT OIL, COCOA PROCESSED WITH ALKALI, CORN SYRUP, DRIED CANE SYRUP, EGG YOLKS, COCOA, PEANUT OIL, MILK, SALT, GUAR GUM, SOY LECITHIN, CARRAGEENAN, NATURAL FLAVOR, VANILLA EXTRACT"
  }
]